podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5.h
/**
 * @file      pin_mapping.h (derived from pin_mapping-MKM33Z5.h)
 * @version   1.0.0
 * @brief     Pin declarations for MKM33Z5
 */

#ifndef PIN_MAPPING_H_
#define PIN_MAPPING_H_

#include "derivative.h"

//-------- <<< Use Configuration Wizard in Context Menu >>> -----------------  

//================================
// Validators
// <validate=net.sourceforge.usbdm.annotationEditor.validators.PinMappingValidator>

// Inline port functions
//
//   <q> Force inline port functions 
//   <i> Forces some small GPIO functions to be inlined
//   <i> This increases speed but may also increase code size
//     <0=> Disabled
//     <1=> Enabled
#define DO_INLINE_GPIO       0

// Pin mapping Options
//
//   <q> Map pins 
//   <i> Selects whether pin mappings are done when individual
//   <i> peripherals are configured or during reset initialisation.
//   <i> This will also cause unselected peripherals to be unavailable.
//     <0=> Pins mapped on demand
//     <1=> Pin mapping on reset  - unselected peripherals unavailable
#define DO_MAP_PINS_ON_RESET 0

// Pin peripheral signal mapping
//   <e> Mapping by Pin <name=MAP_BY_PIN>
//   <i> This allows the mapping of peripheral functions to pins
//   <i> to be controlled by individual pin
//     <0=> Disabled
//     <1=> Enabled
#define MAP_BY_PIN_ENABLED   1

// <h> Miscellaneous Pins

// Signal mapping for EXTAL32K pin
//   <o> EXTAL32K [EXTAL32K]<name=EXTAL32K_SIG_SEL><constant>
//   <i> EXTAL32K has no pin-mapping hardware
//     <-3=> EXTAL32K (fixed)<selection=EXTAL32K_PIN_SEL,EXTAL32K>
#define EXTAL32K_SIG_SEL     -3

// Signal mapping for SDADM0 pin
//   <o> SDADM0 [SDADM0]<name=SDADM0_SIG_SEL><constant>
//   <i> SDADM0 has no pin-mapping hardware
//     <-3=> SDADM0 (fixed)<selection=SDADM0_PIN_SEL,SDADM0>
#define SDADM0_SIG_SEL       -3

// Signal mapping for SDADM1 pin
//   <o> SDADM1 [SDADM1]<name=SDADM1_SIG_SEL><constant>
//   <i> SDADM1 has no pin-mapping hardware
//     <-3=> SDADM1 (fixed)<selection=SDADM1_PIN_SEL,SDADM1>
#define SDADM1_SIG_SEL       -3

// Signal mapping for SDADM2 pin
//   <o> SDADM2 [SDADM2/CMP1P3]<name=SDADM2_SIG_SEL><constant>
//   <i> SDADM2 has no pin-mapping hardware
//     <-3=> SDADM2/CMP1P3 (fixed)<selection=SDADM2_PIN_SEL,SDADM2><selection=CMP1P3_PIN_SEL,SDADM2>
#define SDADM2_SIG_SEL       -3

// Signal mapping for SDADM3 pin
//   <o> SDADM3 [SDADM3/CMP1P5]<name=SDADM3_SIG_SEL><constant>
//   <i> SDADM3 has no pin-mapping hardware
//     <-3=> SDADM3/CMP1P5 (fixed)<selection=SDADM3_PIN_SEL,SDADM3><selection=CMP1P5_PIN_SEL,SDADM3>
#define SDADM3_SIG_SEL       -3

// Signal mapping for SDADP0 pin
//   <o> SDADP0 [SDADP0]<name=SDADP0_SIG_SEL><constant>
//   <i> SDADP0 has no pin-mapping hardware
//     <-3=> SDADP0 (fixed)<selection=SDADP0_PIN_SEL,SDADP0>
#define SDADP0_SIG_SEL       -3

// Signal mapping for SDADP1 pin
//   <o> SDADP1 [SDADP1]<name=SDADP1_SIG_SEL><constant>
//   <i> SDADP1 has no pin-mapping hardware
//     <-3=> SDADP1 (fixed)<selection=SDADP1_PIN_SEL,SDADP1>
#define SDADP1_SIG_SEL       -3

// Signal mapping for SDADP2 pin
//   <o> SDADP2 [SDADP2/CMP1P2]<name=SDADP2_SIG_SEL><constant>
//   <i> SDADP2 has no pin-mapping hardware
//     <-3=> SDADP2/CMP1P2 (fixed)<selection=SDADP2_PIN_SEL,SDADP2><selection=CMP1P2_PIN_SEL,SDADP2>
#define SDADP2_SIG_SEL       -3

// Signal mapping for SDADP3 pin
//   <o> SDADP3 [SDADP3/CMP1P4]<name=SDADP3_SIG_SEL><constant>
//   <i> SDADP3 has no pin-mapping hardware
//     <-3=> SDADP3/CMP1P4 (fixed)<selection=SDADP3_PIN_SEL,SDADP3><selection=CMP1P4_PIN_SEL,SDADP3>
#define SDADP3_SIG_SEL       -3

// Signal mapping for XTAL32K pin
//   <o> XTAL32K [XTAL32K]<name=XTAL32K_SIG_SEL><constant>
//   <i> XTAL32K has no pin-mapping hardware
//     <-3=> XTAL32K (fixed)<selection=XTAL32K_PIN_SEL,XTAL32K>
#define XTAL32K_SIG_SEL      -3

// </h>

// <h> Port A Pins

// Signal mapping for PTA0 pin
//   <o> PTA0 (Alias:LED_RED) [LCD23, GPIOA_0]<name=PTA0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA0 pin
//     <-2=> Disabled (reset default)
//     <0=> LCD23<selection=LCD23_PIN_SEL,PTA0 (Alias:LED_RED)>
//     <1=> GPIOA_0<selection=GPIOA_0_PIN_SEL,PTA0 (Alias:LED_RED)>
//     <1=> Default
#define PTA0_SIG_SEL         1

// Signal mapping for PTA1 pin
//   <o> PTA1 (Alias:LED_GREEN) [LCD24, GPIOA_1]<name=PTA1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA1 pin
//     <-2=> Disabled (reset default)
//     <0=> LCD24<selection=LCD24_PIN_SEL,PTA1 (Alias:LED_GREEN)>
//     <1=> GPIOA_1<selection=GPIOA_1_PIN_SEL,PTA1 (Alias:LED_GREEN)>
//     <1=> Default
#define PTA1_SIG_SEL         1

// Signal mapping for PTA2 pin
//   <o> PTA2 [LCD25, GPIOA_2]<name=PTA2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA2 pin
//     <-2=> Disabled (reset default)
//     <0=> LCD25<selection=LCD25_PIN_SEL,PTA2>
//     <1=> GPIOA_2<selection=GPIOA_2_PIN_SEL,PTA2>
//     <-2=> Default
#define PTA2_SIG_SEL         -2

// Signal mapping for PTA3 pin
//   <o> PTA3 [LCD26, GPIOA_3]<name=PTA3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA3 pin
//     <-2=> Disabled (reset default)
//     <0=> LCD26<selection=LCD26_PIN_SEL,PTA3>
//     <1=> GPIOA_3<selection=GPIOA_3_PIN_SEL,PTA3>
//     <-2=> Default
#define PTA3_SIG_SEL         -2

// Signal mapping for PTA4 pin
//   <o> PTA4 [LCD27, GPIOA_4, LLWU_P15, NMI_B]<name=PTA4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA4 pin
//     <-2=> NMI_B (reset default)<selection=NMI_B_PIN_SEL,PTA4 (reset default)>
//     <0=> LCD27<selection=LCD27_PIN_SEL,PTA4>
//     <1=> GPIOA_4<selection=GPIOA_4_PIN_SEL,PTA4>
//     <2=> LLWU_P15<selection=LLWU_P15_PIN_SEL,PTA4>
//     <7=> NMI_B<selection=NMI_B_PIN_SEL,PTA4>
//     <-2=> Default
#define PTA4_SIG_SEL         -2

// Signal mapping for PTA5 pin
//   <o> PTA5 [LCD28, GPIOA_5, CMP0OUT]<name=PTA5_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA5 pin
//     <-2=> Disabled (reset default)
//     <0=> LCD28<selection=LCD28_PIN_SEL,PTA5>
//     <1=> GPIOA_5<selection=GPIOA_5_PIN_SEL,PTA5>
//     <2=> CMP0OUT<selection=CMP0OUT_PIN_SEL,PTA5>
//     <-2=> Default
#define PTA5_SIG_SEL         -2

