podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5.h
// Pin Mapping for LCD7 signal
//   <o> LCD7 [PTG0]<name=LCD7_PIN_SEL>
//   <i> Shows which pin LCD7 is mapped to
//     <0=> Disabled
//     <1=> PTG0<selection=PTG0_SIG_SEL,LCD7>
//     <0=> Default
#define LCD7_PIN_SEL         0
#if LCD7_PIN_SEL == 1
#define LCD7_GPIO            digitalIO_PTG0
#define LCD7_FN              0
#endif

// Pin Mapping for LCD8 signal
//   <o> LCD8 [PTG1]<name=LCD8_PIN_SEL>
//   <i> Shows which pin LCD8 is mapped to
//     <0=> Disabled
//     <1=> PTG1<selection=PTG1_SIG_SEL,LCD8/ADC0_SE10>
//     <0=> Default
#define LCD8_PIN_SEL         0
#if LCD8_PIN_SEL == 1
#define LCD8_GPIO            digitalIO_PTG1
#define LCD8_FN              0
#endif

// Pin Mapping for LCD9 signal
//   <o> LCD9 [PTG2]<name=LCD9_PIN_SEL>
//   <i> Shows which pin LCD9 is mapped to
//     <0=> Disabled
//     <1=> PTG2<selection=PTG2_SIG_SEL,LCD9/ADC0_SE11>
//     <0=> Default
#define LCD9_PIN_SEL         0
#if LCD9_PIN_SEL == 1
#define LCD9_GPIO            digitalIO_PTG2
#define LCD9_FN              0
#endif

// Pin Mapping for LCD10 signal
//   <o> LCD10 [PTG3]<name=LCD10_PIN_SEL>
//   <i> Shows which pin LCD10 is mapped to
//     <0=> Disabled
//     <1=> PTG3<selection=PTG3_SIG_SEL,LCD10>
//     <0=> Default
#define LCD10_PIN_SEL        0
#if LCD10_PIN_SEL == 1
#define LCD10_GPIO           digitalIO_PTG3
#define LCD10_FN             0
#endif

// Pin Mapping for LCD11 signal
//   <o> LCD11 [PTG4]<name=LCD11_PIN_SEL>
//   <i> Shows which pin LCD11 is mapped to
//     <0=> Disabled
//     <1=> PTG4<selection=PTG4_SIG_SEL,LCD11>
//     <0=> Default
#define LCD11_PIN_SEL        0
#if LCD11_PIN_SEL == 1
#define LCD11_GPIO           digitalIO_PTG4
#define LCD11_FN             0
#endif

// Pin Mapping for LCD12 signal
//   <o> LCD12 [PTG5]<name=LCD12_PIN_SEL>
//   <i> Shows which pin LCD12 is mapped to
//     <0=> Disabled
//     <1=> PTG5<selection=PTG5_SIG_SEL,LCD12>
//     <0=> Default
#define LCD12_PIN_SEL        0
#if LCD12_PIN_SEL == 1
#define LCD12_GPIO           digitalIO_PTG5
#define LCD12_FN             0
#endif

// Pin Mapping for LCD13 signal
//   <o> LCD13 [PTG6]<name=LCD13_PIN_SEL>
//   <i> Shows which pin LCD13 is mapped to
//     <0=> Disabled
//     <1=> PTG6<selection=PTG6_SIG_SEL,LCD13>
//     <0=> Default
#define LCD13_PIN_SEL        0
#if LCD13_PIN_SEL == 1
#define LCD13_GPIO           digitalIO_PTG6
#define LCD13_FN             0
#endif

// Pin Mapping for LCD14 signal
//   <o> LCD14 [PTG7]<name=LCD14_PIN_SEL>
//   <i> Shows which pin LCD14 is mapped to
//     <0=> Disabled
//     <1=> PTG7<selection=PTG7_SIG_SEL,LCD14>
//     <0=> Default
#define LCD14_PIN_SEL        0
#if LCD14_PIN_SEL == 1
#define LCD14_GPIO           digitalIO_PTG7
#define LCD14_FN             0
#endif

// Pin Mapping for LCD15 signal
//   <o> LCD15 [PTH0]<name=LCD15_PIN_SEL>
//   <i> Shows which pin LCD15 is mapped to
//     <0=> Disabled
//     <1=> PTH0<selection=PTH0_SIG_SEL,LCD15>
//     <0=> Default
#define LCD15_PIN_SEL        0
#if LCD15_PIN_SEL == 1
#define LCD15_GPIO           digitalIO_PTH0
#define LCD15_FN             0
#endif

// Pin Mapping for LCD16 signal
//   <o> LCD16 [PTH1]<name=LCD16_PIN_SEL>
//   <i> Shows which pin LCD16 is mapped to
//     <0=> Disabled
//     <1=> PTH1<selection=PTH1_SIG_SEL,LCD16>
//     <0=> Default
#define LCD16_PIN_SEL        0
#if LCD16_PIN_SEL == 1
#define LCD16_GPIO           digitalIO_PTH1
#define LCD16_FN             0
#endif

// Pin Mapping for LCD17 signal
//   <o> LCD17 [PTH2]<name=LCD17_PIN_SEL>
//   <i> Shows which pin LCD17 is mapped to
//     <0=> Disabled
//     <1=> PTH2<selection=PTH2_SIG_SEL,LCD17>
//     <0=> Default
#define LCD17_PIN_SEL        0
#if LCD17_PIN_SEL == 1
#define LCD17_GPIO           digitalIO_PTH2
#define LCD17_FN             0
#endif

// Pin Mapping for LCD18 signal
//   <o> LCD18 [PTH3]<name=LCD18_PIN_SEL>
//   <i> Shows which pin LCD18 is mapped to
//     <0=> Disabled
//     <1=> PTH3<selection=PTH3_SIG_SEL,LCD18>
//     <0=> Default
#define LCD18_PIN_SEL        0
#if LCD18_PIN_SEL == 1
#define LCD18_GPIO           digitalIO_PTH3
#define LCD18_FN             0
#endif

// Pin Mapping for LCD19 signal
//   <o> LCD19 [PTH4]<name=LCD19_PIN_SEL>
//   <i> Shows which pin LCD19 is mapped to
//     <0=> Disabled
//     <1=> PTH4<selection=PTH4_SIG_SEL,LCD19>
//     <0=> Default
#define LCD19_PIN_SEL        0
#if LCD19_PIN_SEL == 1
#define LCD19_GPIO           digitalIO_PTH4
#define LCD19_FN             0
#endif

// Pin Mapping for LCD20 signal
//   <o> LCD20 [PTH5]<name=LCD20_PIN_SEL>
//   <i> Shows which pin LCD20 is mapped to
//     <0=> Disabled
//     <1=> PTH5<selection=PTH5_SIG_SEL,LCD20>
//     <0=> Default
#define LCD20_PIN_SEL        0
#if LCD20_PIN_SEL == 1
#define LCD20_GPIO           digitalIO_PTH5
#define LCD20_FN             0
#endif

// Pin Mapping for LCD21 signal
//   <o> LCD21 [PTI2]<name=LCD21_PIN_SEL>
//   <i> Shows which pin LCD21 is mapped to
//     <0=> Disabled
//     <1=> PTI2<selection=PTI2_SIG_SEL,LCD21>
//     <0=> Default
#define LCD21_PIN_SEL        0
#if LCD21_PIN_SEL == 1
#define LCD21_GPIO           digitalIO_PTI2
#define LCD21_FN             0
#endif

// Pin Mapping for LCD22 signal
//   <o> LCD22 [PTI3]<name=LCD22_PIN_SEL>
//   <i> Shows which pin LCD22 is mapped to
//     <0=> Disabled
//     <1=> PTI3<selection=PTI3_SIG_SEL,LCD22>
//     <0=> Default
#define LCD22_PIN_SEL        0
#if LCD22_PIN_SEL == 1
#define LCD22_GPIO           digitalIO_PTI3
#define LCD22_FN             0
#endif

// Pin Mapping for LCD23 signal
//   <o> LCD23 [PTA0]<name=LCD23_PIN_SEL>
//   <i> Shows which pin LCD23 is mapped to
//     <0=> Disabled
//     <1=> PTA0 (Alias:LED_RED)<selection=PTA0_SIG_SEL,LCD23>
//     <0=> Default
#define LCD23_PIN_SEL        0
#if LCD23_PIN_SEL == 1
#define LCD23_GPIO           digitalIO_PTA0
#define LCD23_FN             0
#endif

// Pin Mapping for LCD24 signal
//   <o> LCD24 [PTA1]<name=LCD24_PIN_SEL>
//   <i> Shows which pin LCD24 is mapped to
//     <0=> Disabled
//     <1=> PTA1 (Alias:LED_GREEN)<selection=PTA1_SIG_SEL,LCD24>
//     <0=> Default
#define LCD24_PIN_SEL        0
#if LCD24_PIN_SEL == 1
#define LCD24_GPIO           digitalIO_PTA1
#define LCD24_FN             0
#endif

// Pin Mapping for LCD25 signal
//   <o> LCD25 [PTA2]<name=LCD25_PIN_SEL>
//   <i> Shows which pin LCD25 is mapped to
//     <0=> Disabled
//     <1=> PTA2<selection=PTA2_SIG_SEL,LCD25>
//     <0=> Default
#define LCD25_PIN_SEL        0
#if LCD25_PIN_SEL == 1
#define LCD25_GPIO           digitalIO_PTA2
#define LCD25_FN             0
#endif

