podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5.h
// Pin Mapping for LCD26 signal
//   <o> LCD26 [PTA3]<name=LCD26_PIN_SEL>
//   <i> Shows which pin LCD26 is mapped to
//     <0=> Disabled
//     <1=> PTA3<selection=PTA3_SIG_SEL,LCD26>
//     <0=> Default
#define LCD26_PIN_SEL        0
#if LCD26_PIN_SEL == 1
#define LCD26_GPIO           digitalIO_PTA3
#define LCD26_FN             0
#endif

// Pin Mapping for LCD27 signal
//   <o> LCD27 [PTA4]<name=LCD27_PIN_SEL>
//   <i> Shows which pin LCD27 is mapped to
//     <0=> Disabled
//     <1=> PTA4<selection=PTA4_SIG_SEL,LCD27>
//     <0=> Default
#define LCD27_PIN_SEL        0
#if LCD27_PIN_SEL == 1
#define LCD27_GPIO           digitalIO_PTA4
#define LCD27_FN             0
#endif

// Pin Mapping for LCD28 signal
//   <o> LCD28 [PTA5]<name=LCD28_PIN_SEL>
//   <i> Shows which pin LCD28 is mapped to
//     <0=> Disabled
//     <1=> PTA5<selection=PTA5_SIG_SEL,LCD28>
//     <0=> Default
#define LCD28_PIN_SEL        0
#if LCD28_PIN_SEL == 1
#define LCD28_GPIO           digitalIO_PTA5
#define LCD28_FN             0
#endif

// Pin Mapping for LCD29 signal
//   <o> LCD29 [PTA6]<name=LCD29_PIN_SEL>
//   <i> Shows which pin LCD29 is mapped to
//     <0=> Disabled
//     <1=> PTA6<selection=PTA6_SIG_SEL,LCD29>
//     <0=> Default
#define LCD29_PIN_SEL        0
#if LCD29_PIN_SEL == 1
#define LCD29_GPIO           digitalIO_PTA6
#define LCD29_FN             0
#endif

// Pin Mapping for LCD30 signal
//   <o> LCD30 [PTA7]<name=LCD30_PIN_SEL>
//   <i> Shows which pin LCD30 is mapped to
//     <0=> Disabled
//     <1=> PTA7<selection=PTA7_SIG_SEL,LCD30>
//     <0=> Default
#define LCD30_PIN_SEL        0
#if LCD30_PIN_SEL == 1
#define LCD30_GPIO           digitalIO_PTA7
#define LCD30_FN             0
#endif

// Pin Mapping for LCD31 signal
//   <o> LCD31 [PTB0]<name=LCD31_PIN_SEL>
//   <i> Shows which pin LCD31 is mapped to
//     <0=> Disabled
//     <1=> PTB0<selection=PTB0_SIG_SEL,LCD31>
//     <0=> Default
#define LCD31_PIN_SEL        0
#if LCD31_PIN_SEL == 1
#define LCD31_GPIO           digitalIO_PTB0
#define LCD31_FN             0
#endif

// Pin Mapping for LCD32 signal
//   <o> LCD32 [PTB1]<name=LCD32_PIN_SEL>
//   <i> Shows which pin LCD32 is mapped to
//     <0=> Disabled
//     <1=> PTB1<selection=PTB1_SIG_SEL,LCD32>
//     <0=> Default
#define LCD32_PIN_SEL        0
#if LCD32_PIN_SEL == 1
#define LCD32_GPIO           digitalIO_PTB1
#define LCD32_FN             0
#endif

// Pin Mapping for LCD33 signal
//   <o> LCD33 [PTB2]<name=LCD33_PIN_SEL>
//   <i> Shows which pin LCD33 is mapped to
//     <0=> Disabled
//     <1=> PTB2<selection=PTB2_SIG_SEL,LCD33>
//     <0=> Default
#define LCD33_PIN_SEL        0
#if LCD33_PIN_SEL == 1
#define LCD33_GPIO           digitalIO_PTB2
#define LCD33_FN             0
#endif

// Pin Mapping for LCD34 signal
//   <o> LCD34 [PTB3]<name=LCD34_PIN_SEL>
//   <i> Shows which pin LCD34 is mapped to
//     <0=> Disabled
//     <1=> PTB3<selection=PTB3_SIG_SEL,LCD34>
//     <0=> Default
#define LCD34_PIN_SEL        0
#if LCD34_PIN_SEL == 1
#define LCD34_GPIO           digitalIO_PTB3
#define LCD34_FN             0
#endif

// Pin Mapping for LCD35 signal
//   <o> LCD35 [PTB4]<name=LCD35_PIN_SEL>
//   <i> Shows which pin LCD35 is mapped to
//     <0=> Disabled
//     <1=> PTB4<selection=PTB4_SIG_SEL,LCD35>
//     <0=> Default
#define LCD35_PIN_SEL        0
#if LCD35_PIN_SEL == 1
#define LCD35_GPIO           digitalIO_PTB4
#define LCD35_FN             0
#endif

// Pin Mapping for LCD36 signal
//   <o> LCD36 [PTB5]<name=LCD36_PIN_SEL>
//   <i> Shows which pin LCD36 is mapped to
//     <0=> Disabled
//     <1=> PTB5<selection=PTB5_SIG_SEL,LCD36>
//     <0=> Default
#define LCD36_PIN_SEL        0
#if LCD36_PIN_SEL == 1
#define LCD36_GPIO           digitalIO_PTB5
#define LCD36_FN             0
#endif

// Pin Mapping for LCD37 signal
//   <o> LCD37 [PTB6]<name=LCD37_PIN_SEL>
//   <i> Shows which pin LCD37 is mapped to
//     <0=> Disabled
//     <1=> PTB6<selection=PTB6_SIG_SEL,LCD37/CMP1P0>
//     <0=> Default
#define LCD37_PIN_SEL        0
#if LCD37_PIN_SEL == 1
#define LCD37_GPIO           digitalIO_PTB6
#define LCD37_FN             0
#endif

// Pin Mapping for LCD38 signal
//   <o> LCD38 [PTB7]<name=LCD38_PIN_SEL>
//   <i> Shows which pin LCD38 is mapped to
//     <0=> Disabled
//     <1=> PTB7<selection=PTB7_SIG_SEL,LCD38>
//     <0=> Default
#define LCD38_PIN_SEL        0
#if LCD38_PIN_SEL == 1
#define LCD38_GPIO           digitalIO_PTB7
#define LCD38_FN             0
#endif

// Pin Mapping for LCD39 signal
//   <o> LCD39 [PTC0]<name=LCD39_PIN_SEL>
//   <i> Shows which pin LCD39 is mapped to
//     <0=> Disabled
//     <1=> PTC0<selection=PTC0_SIG_SEL,LCD39>
//     <0=> Default
#define LCD39_PIN_SEL        0
#if LCD39_PIN_SEL == 1
#define LCD39_GPIO           digitalIO_PTC0
#define LCD39_FN             0
#endif

// Pin Mapping for LCD40 signal
//   <o> LCD40 [PTC1]<name=LCD40_PIN_SEL>
//   <i> Shows which pin LCD40 is mapped to
//     <0=> Disabled
//     <1=> PTC1<selection=PTC1_SIG_SEL,LCD40/CMP1P1>
//     <0=> Default
#define LCD40_PIN_SEL        0
#if LCD40_PIN_SEL == 1
#define LCD40_GPIO           digitalIO_PTC1
#define LCD40_FN             0
#endif

// Pin Mapping for LCD41 signal
//   <o> LCD41 [PTC2]<name=LCD41_PIN_SEL>
//   <i> Shows which pin LCD41 is mapped to
//     <0=> Disabled
//     <1=> PTC2<selection=PTC2_SIG_SEL,LCD41>
//     <0=> Default
#define LCD41_PIN_SEL        0
#if LCD41_PIN_SEL == 1
#define LCD41_GPIO           digitalIO_PTC2
#define LCD41_FN             0
#endif

// Pin Mapping for LCD42 signal
//   <o> LCD42 [PTC3]<name=LCD42_PIN_SEL>
//   <i> Shows which pin LCD42 is mapped to
//     <0=> Disabled
//     <1=> PTC3<selection=PTC3_SIG_SEL,LCD42/CMP0P3>
//     <0=> Default
#define LCD42_PIN_SEL        0
#if LCD42_PIN_SEL == 1
#define LCD42_GPIO           digitalIO_PTC3
#define LCD42_FN             0
#endif

// Pin Mapping for LCD43 signal
//   <o> LCD43 [PTC4]<name=LCD43_PIN_SEL>
//   <i> Shows which pin LCD43 is mapped to
//     <0=> Disabled
//     <1=> PTC4<selection=PTC4_SIG_SEL,LCD43>
//     <0=> Default
#define LCD43_PIN_SEL        0
#if LCD43_PIN_SEL == 1
#define LCD43_GPIO           digitalIO_PTC4
#define LCD43_FN             0
#endif

