podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5.h
// </h>

// <h> Analogue to Digital (ADC0)

// Pin Mapping for ADC0_SE0 signal
//   <o> ADC0_SE0 [PTC5]<name=ADC0_SE0_PIN_SEL>
//   <i> Shows which pin ADC0_SE0 is mapped to
//     <0=> Disabled
//     <1=> PTC5<selection=PTC5_SIG_SEL,ADC0_SE0>
//     <0=> Default
#define ADC0_SE0_PIN_SEL     0
#if ADC0_SE0_PIN_SEL == 1
#define ADC0_SE0_GPIO        digitalIO_PTC5
#define ADC0_SE0_FN          0
#endif

// Pin Mapping for ADC0_SE1 signal
//   <o> ADC0_SE1 [PTC6]<name=ADC0_SE1_PIN_SEL>
//   <i> Shows which pin ADC0_SE1 is mapped to
//     <0=> Disabled
//     <1=> PTC6<selection=PTC6_SIG_SEL,ADC0_SE1>
//     <0=> Default
#define ADC0_SE1_PIN_SEL     0
#if ADC0_SE1_PIN_SEL == 1
#define ADC0_SE1_GPIO        digitalIO_PTC6
#define ADC0_SE1_FN          0
#endif

// Pin Mapping for ADC0_SE2 signal
//   <o> ADC0_SE2 [PTC7]<name=ADC0_SE2_PIN_SEL>
//   <i> Shows which pin ADC0_SE2 is mapped to
//     <0=> Disabled
//     <1=> PTC7<selection=PTC7_SIG_SEL,ADC0_SE2>
//     <0=> Default
#define ADC0_SE2_PIN_SEL     0
#if ADC0_SE2_PIN_SEL == 1
#define ADC0_SE2_GPIO        digitalIO_PTC7
#define ADC0_SE2_FN          0
#endif

// Pin Mapping for ADC0_SE3 signal
//   <o> ADC0_SE3 [PTD4]<name=ADC0_SE3_PIN_SEL>
//   <i> Shows which pin ADC0_SE3 is mapped to
//     <0=> Disabled
//     <1=> PTD4<selection=PTD4_SIG_SEL,ADC0_SE3>
//     <0=> Default
#define ADC0_SE3_PIN_SEL     0
#if ADC0_SE3_PIN_SEL == 1
#define ADC0_SE3_GPIO        digitalIO_PTD4
#define ADC0_SE3_FN          0
#endif

// Pin Mapping for ADC0_SE4 signal
//   <o> ADC0_SE4 [PTD5]<name=ADC0_SE4_PIN_SEL>
//   <i> Shows which pin ADC0_SE4 is mapped to
//     <0=> Disabled
//     <1=> PTD5<selection=PTD5_SIG_SEL,ADC0_SE4>
//     <0=> Default
#define ADC0_SE4_PIN_SEL     0
#if ADC0_SE4_PIN_SEL == 1
#define ADC0_SE4_GPIO        digitalIO_PTD5
#define ADC0_SE4_FN          0
#endif

// Pin Mapping for ADC0_SE5 signal
//   <o> ADC0_SE5 [PTD6]<name=ADC0_SE5_PIN_SEL>
//   <i> Shows which pin ADC0_SE5 is mapped to
//     <0=> Disabled
//     <1=> PTD6<selection=PTD6_SIG_SEL,ADC0_SE5>
//     <0=> Default
#define ADC0_SE5_PIN_SEL     0
#if ADC0_SE5_PIN_SEL == 1
#define ADC0_SE5_GPIO        digitalIO_PTD6
#define ADC0_SE5_FN          0
#endif

// Pin Mapping for ADC0_SE6 signal
//   <o> ADC0_SE6 [PTE7]<name=ADC0_SE6_PIN_SEL>
//   <i> Shows which pin ADC0_SE6 is mapped to
//     <0=> Disabled
//     <1=> PTE7<selection=PTE7_SIG_SEL,ADC0_SE6>
//     <0=> Default
#define ADC0_SE6_PIN_SEL     0
#if ADC0_SE6_PIN_SEL == 1
#define ADC0_SE6_GPIO        digitalIO_PTE7
#define ADC0_SE6_FN          0
#endif

// Pin Mapping for ADC0_SE7 signal
//   <o> ADC0_SE7 [PTF0]<name=ADC0_SE7_PIN_SEL>
//   <i> Shows which pin ADC0_SE7 is mapped to
//     <0=> Disabled
//     <1=> PTF0<selection=PTF0_SIG_SEL,ADC0_SE7>
//     <0=> Default
#define ADC0_SE7_PIN_SEL     0
#if ADC0_SE7_PIN_SEL == 1
#define ADC0_SE7_GPIO        digitalIO_PTF0
#define ADC0_SE7_FN          0
#endif

// Pin Mapping for ADC0_SE8 signal
//   <o> ADC0_SE8 [PTF1]<name=ADC0_SE8_PIN_SEL>
//   <i> Shows which pin ADC0_SE8 is mapped to
//     <0=> Disabled
//     <1=> PTF1<selection=PTF1_SIG_SEL,LCD0/ADC0_SE8>
//     <0=> Default
#define ADC0_SE8_PIN_SEL     0
#if ADC0_SE8_PIN_SEL == 1
#define ADC0_SE8_GPIO        digitalIO_PTF1
#define ADC0_SE8_FN          0
#endif

// Pin Mapping for ADC0_SE9 signal
//   <o> ADC0_SE9 [PTF2]<name=ADC0_SE9_PIN_SEL>
//   <i> Shows which pin ADC0_SE9 is mapped to
//     <0=> Disabled
//     <1=> PTF2<selection=PTF2_SIG_SEL,LCD1/ADC0_SE9>
//     <0=> Default
#define ADC0_SE9_PIN_SEL     0
#if ADC0_SE9_PIN_SEL == 1
#define ADC0_SE9_GPIO        digitalIO_PTF2
#define ADC0_SE9_FN          0
#endif

// Pin Mapping for ADC0_SE10 signal
//   <o> ADC0_SE10 [PTG1]<name=ADC0_SE10_PIN_SEL>
//   <i> Shows which pin ADC0_SE10 is mapped to
//     <0=> Disabled
//     <1=> PTG1<selection=PTG1_SIG_SEL,LCD8/ADC0_SE10>
//     <0=> Default
#define ADC0_SE10_PIN_SEL    0
#if ADC0_SE10_PIN_SEL == 1
#define ADC0_SE10_GPIO       digitalIO_PTG1
#define ADC0_SE10_FN         0
#endif

// Pin Mapping for ADC0_SE11 signal
//   <o> ADC0_SE11 [PTG2]<name=ADC0_SE11_PIN_SEL>
//   <i> Shows which pin ADC0_SE11 is mapped to
//     <0=> Disabled
//     <1=> PTG2<selection=PTG2_SIG_SEL,LCD9/ADC0_SE11>
//     <0=> Default
#define ADC0_SE11_PIN_SEL    0
#if ADC0_SE11_PIN_SEL == 1
#define ADC0_SE11_GPIO       digitalIO_PTG2
#define ADC0_SE11_FN         0
#endif

// </h>

// <h> Clock and Timing

// Pin Mapping for AFE_CLK signal
//   <o> AFE_CLK [PTB7, PTE3]<name=AFE_CLK_PIN_SEL>
//   <i> Shows which pin AFE_CLK is mapped to
//     <0=> Disabled
//     <1=> PTB7<selection=PTB7_SIG_SEL,AFE_CLK>
//     <2=> PTE3<selection=PTE3_SIG_SEL,AFE_CLK>
//     <0=> Default
#define AFE_CLK_PIN_SEL      0
#if AFE_CLK_PIN_SEL == 1
#define AFE_CLK_GPIO         digitalIO_PTB7
#define AFE_CLK_FN           2
#elif AFE_CLK_PIN_SEL == 2
#define AFE_CLK_GPIO         digitalIO_PTE3
#define AFE_CLK_FN           3
#endif

// Pin Mapping for CLKOUT signal
//   <o> CLKOUT [PTF7, PTE0]<name=CLKOUT_PIN_SEL>
//   <i> Shows which pin CLKOUT is mapped to
//     <0=> Disabled
//     <1=> PTF7<selection=PTF7_SIG_SEL,CLKOUT>
//     <2=> PTE0<selection=PTE0_SIG_SEL,CLKOUT>
//     <0=> Default
#define CLKOUT_PIN_SEL       0
#if CLKOUT_PIN_SEL == 1
#define CLKOUT_GPIO          digitalIO_PTF7
#define CLKOUT_FN            3
#elif CLKOUT_PIN_SEL == 2
#define CLKOUT_GPIO          digitalIO_PTE0
#define CLKOUT_FN            5
#endif

// Pin Mapping for EXTAL1 signal
//   <o> EXTAL1 [PTE2]<name=EXTAL1_PIN_SEL>
//   <i> Shows which pin EXTAL1 is mapped to
//     <0=> Disabled
//     <1=> PTE2 (reset default)<selection=PTE2_SIG_SEL,EXTAL1 (reset default)>
//     <2=> PTE2<selection=PTE2_SIG_SEL,EXTAL1>
//     <1=> Default
#define EXTAL1_PIN_SEL       1
#if EXTAL1_PIN_SEL == 2
#define EXTAL1_GPIO          digitalIO_PTE2
#define EXTAL1_FN            0
#endif

// Pin Mapping for EXTAL32K signal
//   <o> EXTAL32K [EXTAL32K]<name=EXTAL32K_PIN_SEL><constant>
//   <i> Shows which pin EXTAL32K is mapped to
//     <0=> EXTAL32K<selection=EXTAL32K_SIG_SEL,EXTAL32K>
//     <0=> Default
#define EXTAL32K_PIN_SEL     0
#define EXTAL32K_GPIO        0
#define EXTAL32K_FN          0

// Pin Mapping for RTCCLKOUT signal
//   <o> RTCCLKOUT [PTF0, PTF2]<name=RTCCLKOUT_PIN_SEL>
//   <i> Shows which pin RTCCLKOUT is mapped to
//     <0=> Disabled
//     <1=> PTF0<selection=PTF0_SIG_SEL,RTCCLKOUT>
//     <2=> PTF2<selection=PTF2_SIG_SEL,RTCCLKOUT>
//     <0=> Default
#define RTCCLKOUT_PIN_SEL    0
#if RTCCLKOUT_PIN_SEL == 1
#define RTCCLKOUT_GPIO       digitalIO_PTF0
#define RTCCLKOUT_FN         2
#elif RTCCLKOUT_PIN_SEL == 2
#define RTCCLKOUT_GPIO       digitalIO_PTF2
#define RTCCLKOUT_FN         3
#endif

// Pin Mapping for XTAL1 signal
//   <o> XTAL1 [PTE3]<name=XTAL1_PIN_SEL>
//   <i> Shows which pin XTAL1 is mapped to
//     <0=> Disabled
//     <1=> PTE3 (reset default)<selection=PTE3_SIG_SEL,XTAL1 (reset default)>
//     <2=> PTE3<selection=PTE3_SIG_SEL,XTAL1>
//     <1=> Default
#define XTAL1_PIN_SEL        1
#if XTAL1_PIN_SEL == 2
#define XTAL1_GPIO           digitalIO_PTE3
#define XTAL1_FN             0
#endif

