podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5.h
// Pin Mapping for XTAL32K signal
//   <o> XTAL32K [XTAL32K]<name=XTAL32K_PIN_SEL><constant>
//   <i> Shows which pin XTAL32K is mapped to
//     <0=> XTAL32K<selection=XTAL32K_SIG_SEL,XTAL32K>
//     <0=> Default
#define XTAL32K_PIN_SEL      0
#define XTAL32K_GPIO         0
#define XTAL32K_FN           0

// </h>

// <h> Analogue Comparator (CMP0)

// Pin Mapping for CMP0OUT signal
//   <o> CMP0OUT [PTA5, PTF0]<name=CMP0OUT_PIN_SEL>
//   <i> Shows which pin CMP0OUT is mapped to
//     <0=> Disabled
//     <1=> PTA5<selection=PTA5_SIG_SEL,CMP0OUT>
//     <2=> PTF0<selection=PTF0_SIG_SEL,CMP0OUT>
//     <0=> Default
#define CMP0OUT_PIN_SEL      0
#if CMP0OUT_PIN_SEL == 1
#define CMP0OUT_GPIO         digitalIO_PTA5
#define CMP0OUT_FN           2
#elif CMP0OUT_PIN_SEL == 2
#define CMP0OUT_GPIO         digitalIO_PTF0
#define CMP0OUT_FN           4
#endif

// Pin Mapping for CMP0P0 signal
//   <o> CMP0P0 [PTD0]<name=CMP0P0_PIN_SEL>
//   <i> Shows which pin CMP0P0 is mapped to
//     <0=> Disabled
//     <1=> PTD0<selection=PTD0_SIG_SEL,CMP0P0>
//     <0=> Default
#define CMP0P0_PIN_SEL       0
#if CMP0P0_PIN_SEL == 1
#define CMP0P0_GPIO          digitalIO_PTD0
#define CMP0P0_FN            0
#endif

// Pin Mapping for CMP0P1 signal
//   <o> CMP0P1 [PTD2]<name=CMP0P1_PIN_SEL>
//   <i> Shows which pin CMP0P1 is mapped to
//     <0=> Disabled
//     <1=> PTD2<selection=PTD2_SIG_SEL,CMP0P1>
//     <0=> Default
#define CMP0P1_PIN_SEL       0
#if CMP0P1_PIN_SEL == 1
#define CMP0P1_GPIO          digitalIO_PTD2
#define CMP0P1_FN            0
#endif

// Pin Mapping for CMP0P2 signal
//   <o> CMP0P2 [PTE6]<name=CMP0P2_PIN_SEL>
//   <i> Shows which pin CMP0P2 is mapped to
//     <0=> Disabled
//     <1=> PTE6<selection=PTE6_SIG_SEL,CMP0P2>
//     <0=> Default
#define CMP0P2_PIN_SEL       0
#if CMP0P2_PIN_SEL == 1
#define CMP0P2_GPIO          digitalIO_PTE6
#define CMP0P2_FN            0
#endif

// Pin Mapping for CMP0P3 signal
//   <o> CMP0P3 [PTC3]<name=CMP0P3_PIN_SEL>
//   <i> Shows which pin CMP0P3 is mapped to
//     <0=> Disabled
//     <1=> PTC3<selection=PTC3_SIG_SEL,LCD42/CMP0P3>
//     <0=> Default
#define CMP0P3_PIN_SEL       0
#if CMP0P3_PIN_SEL == 1
#define CMP0P3_GPIO          digitalIO_PTC3
#define CMP0P3_FN            0
#endif

// Pin Mapping for CMP0P4 signal
//   <o> CMP0P4 [PTD7]<name=CMP0P4_PIN_SEL>
//   <i> Shows which pin CMP0P4 is mapped to
//     <0=> Disabled
//     <1=> PTD7<selection=PTD7_SIG_SEL,CMP0P4>
//     <0=> Default
#define CMP0P4_PIN_SEL       0
#if CMP0P4_PIN_SEL == 1
#define CMP0P4_GPIO          digitalIO_PTD7
#define CMP0P4_FN            0
#endif

// Pin Mapping for CMP0P5 signal
//   <o> CMP0P5 [PTI0]<name=CMP0P5_PIN_SEL>
//   <i> Shows which pin CMP0P5 is mapped to
//     <0=> Disabled
//     <1=> PTI0<selection=PTI0_SIG_SEL,CMP0P5>
//     <0=> Default
#define CMP0P5_PIN_SEL       0
#if CMP0P5_PIN_SEL == 1
#define CMP0P5_GPIO          digitalIO_PTI0
#define CMP0P5_FN            0
#endif

// </h>

// <h> Analogue Comparator (CMP1)

// Pin Mapping for CMP1OUT signal
//   <o> CMP1OUT [PTF2, PTD6]<name=CMP1OUT_PIN_SEL>
//   <i> Shows which pin CMP1OUT is mapped to
//     <0=> Disabled
//     <1=> PTF2<selection=PTF2_SIG_SEL,CMP1OUT>
//     <2=> PTD6<selection=PTD6_SIG_SEL,CMP1OUT>
//     <0=> Default
#define CMP1OUT_PIN_SEL      0
#if CMP1OUT_PIN_SEL == 1
#define CMP1OUT_GPIO         digitalIO_PTF2
#define CMP1OUT_FN           2
#elif CMP1OUT_PIN_SEL == 2
#define CMP1OUT_GPIO         digitalIO_PTD6
#define CMP1OUT_FN           3
#endif

// Pin Mapping for CMP1P0 signal
//   <o> CMP1P0 [PTB6]<name=CMP1P0_PIN_SEL>
//   <i> Shows which pin CMP1P0 is mapped to
//     <0=> Disabled
//     <1=> PTB6<selection=PTB6_SIG_SEL,LCD37/CMP1P0>
//     <0=> Default
#define CMP1P0_PIN_SEL       0
#if CMP1P0_PIN_SEL == 1
#define CMP1P0_GPIO          digitalIO_PTB6
#define CMP1P0_FN            0
#endif

// Pin Mapping for CMP1P1 signal
//   <o> CMP1P1 [PTC1]<name=CMP1P1_PIN_SEL>
//   <i> Shows which pin CMP1P1 is mapped to
//     <0=> Disabled
//     <1=> PTC1<selection=PTC1_SIG_SEL,LCD40/CMP1P1>
//     <0=> Default
#define CMP1P1_PIN_SEL       0
#if CMP1P1_PIN_SEL == 1
#define CMP1P1_GPIO          digitalIO_PTC1
#define CMP1P1_FN            0
#endif

// Pin Mapping for CMP1P2 signal
//   <o> CMP1P2 [SDADP2]<name=CMP1P2_PIN_SEL><constant>
//   <i> Shows which pin CMP1P2 is mapped to
//     <0=> SDADP2<selection=SDADP2_SIG_SEL,SDADP2/CMP1P2>
//     <0=> Default
#define CMP1P2_PIN_SEL       0
#define CMP1P2_GPIO          0
#define CMP1P2_FN            0

// Pin Mapping for CMP1P3 signal
//   <o> CMP1P3 [SDADM2]<name=CMP1P3_PIN_SEL><constant>
//   <i> Shows which pin CMP1P3 is mapped to
//     <0=> SDADM2<selection=SDADM2_SIG_SEL,SDADM2/CMP1P3>
//     <0=> Default
#define CMP1P3_PIN_SEL       0
#define CMP1P3_GPIO          0
#define CMP1P3_FN            0

// Pin Mapping for CMP1P4 signal
//   <o> CMP1P4 [SDADP3]<name=CMP1P4_PIN_SEL><constant>
//   <i> Shows which pin CMP1P4 is mapped to
//     <0=> SDADP3<selection=SDADP3_SIG_SEL,SDADP3/CMP1P4>
//     <0=> Default
#define CMP1P4_PIN_SEL       0
#define CMP1P4_GPIO          0
#define CMP1P4_FN            0

// Pin Mapping for CMP1P5 signal
//   <o> CMP1P5 [SDADM3]<name=CMP1P5_PIN_SEL><constant>
//   <i> Shows which pin CMP1P5 is mapped to
//     <0=> SDADM3<selection=SDADM3_SIG_SEL,SDADM3/CMP1P5>
//     <0=> Default
#define CMP1P5_PIN_SEL       0
#define CMP1P5_GPIO          0
#define CMP1P5_FN            0

// </h>

// <h> External Watchdog Monitor (EWM)

// Pin Mapping for EWM_IN signal
//   <o> EWM_IN [PTE2, PTE4]<name=EWM_IN_PIN_SEL>
//   <i> Shows which pin EWM_IN is mapped to
//     <0=> Disabled
//     <1=> PTE2<selection=PTE2_SIG_SEL,EWM_IN>
//     <2=> PTE4<selection=PTE4_SIG_SEL,EWM_IN>
//     <0=> Default
#define EWM_IN_PIN_SEL       0
#if EWM_IN_PIN_SEL == 1
#define EWM_IN_GPIO          digitalIO_PTE2
#define EWM_IN_FN            2
#elif EWM_IN_PIN_SEL == 2
#define EWM_IN_GPIO          digitalIO_PTE4
#define EWM_IN_FN            4
#endif

// Pin Mapping for EWM_OUT signal
//   <o> EWM_OUT [PTE3, PTE5]<name=EWM_OUT_PIN_SEL>
//   <i> Shows which pin EWM_OUT is mapped to
//     <0=> Disabled
//     <1=> PTE3<selection=PTE3_SIG_SEL,EWM_OUT>
//     <2=> PTE5<selection=PTE5_SIG_SEL,EWM_OUT>
//     <0=> Default
#define EWM_OUT_PIN_SEL      0
#if EWM_OUT_PIN_SEL == 1
#define EWM_OUT_GPIO         digitalIO_PTE3
#define EWM_OUT_FN           2
#elif EWM_OUT_PIN_SEL == 2
#define EWM_OUT_GPIO         digitalIO_PTE5
#define EWM_OUT_FN           4
#endif

