podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5.h
// Pin Mapping for GPIOE_2 signal
//   <o> GPIOE_2 [PTE2]<name=GPIOE_2_PIN_SEL>
//   <i> Shows which pin GPIOE_2 is mapped to
//     <0=> Disabled
//     <1=> PTE2<selection=PTE2_SIG_SEL,GPIOE_2>
//     <0=> Default
#define GPIOE_2_PIN_SEL      0
#if GPIOE_2_PIN_SEL == 1
#define GPIOE_2_GPIO         digitalIO_PTE2
#define GPIOE_2_FN           1
#endif

// Pin Mapping for GPIOE_3 signal
//   <o> GPIOE_3 [PTE3]<name=GPIOE_3_PIN_SEL>
//   <i> Shows which pin GPIOE_3 is mapped to
//     <0=> Disabled
//     <1=> PTE3<selection=PTE3_SIG_SEL,GPIOE_3>
//     <0=> Default
#define GPIOE_3_PIN_SEL      0
#if GPIOE_3_PIN_SEL == 1
#define GPIOE_3_GPIO         digitalIO_PTE3
#define GPIOE_3_FN           1
#endif

// Pin Mapping for GPIOE_4 signal
//   <o> GPIOE_4 [PTE4]<name=GPIOE_4_PIN_SEL>
//   <i> Shows which pin GPIOE_4 is mapped to
//     <0=> Disabled
//     <1=> PTE4<selection=PTE4_SIG_SEL,GPIOE_4>
//     <0=> Default
#define GPIOE_4_PIN_SEL      0
#if GPIOE_4_PIN_SEL == 1
#define GPIOE_4_GPIO         digitalIO_PTE4
#define GPIOE_4_FN           1
#endif

// Pin Mapping for GPIOE_5 signal
//   <o> GPIOE_5 [PTE5]<name=GPIOE_5_PIN_SEL>
//   <i> Shows which pin GPIOE_5 is mapped to
//     <0=> Disabled
//     <1=> PTE5<selection=PTE5_SIG_SEL,GPIOE_5>
//     <0=> Default
#define GPIOE_5_PIN_SEL      0
#if GPIOE_5_PIN_SEL == 1
#define GPIOE_5_GPIO         digitalIO_PTE5
#define GPIOE_5_FN           1
#endif

// Pin Mapping for GPIOE_6 signal
//   <o> GPIOE_6 [PTE6]<name=GPIOE_6_PIN_SEL>
//   <i> Shows which pin GPIOE_6 is mapped to
//     <0=> Disabled
//     <1=> PTE6<selection=PTE6_SIG_SEL,GPIOE_6>
//     <0=> Default
#define GPIOE_6_PIN_SEL      0
#if GPIOE_6_PIN_SEL == 1
#define GPIOE_6_GPIO         digitalIO_PTE6
#define GPIOE_6_FN           1
#endif

// Pin Mapping for GPIOE_7 signal
//   <o> GPIOE_7 [PTE7]<name=GPIOE_7_PIN_SEL>
//   <i> Shows which pin GPIOE_7 is mapped to
//     <0=> Disabled
//     <1=> PTE7<selection=PTE7_SIG_SEL,GPIOE_7>
//     <0=> Default
#define GPIOE_7_PIN_SEL      0
#if GPIOE_7_PIN_SEL == 1
#define GPIOE_7_GPIO         digitalIO_PTE7
#define GPIOE_7_FN           1
#endif

// </h>

// <h> General Purpose I/O (GPIOF)

// Pin Mapping for GPIOF_0 signal
//   <o> GPIOF_0 [PTF0]<name=GPIOF_0_PIN_SEL>
//   <i> Shows which pin GPIOF_0 is mapped to
//     <0=> Disabled
//     <1=> PTF0<selection=PTF0_SIG_SEL,GPIOF_0>
//     <0=> Default
#define GPIOF_0_PIN_SEL      0
#if GPIOF_0_PIN_SEL == 1
#define GPIOF_0_GPIO         digitalIO_PTF0
#define GPIOF_0_FN           1
#endif

// Pin Mapping for GPIOF_1 signal
//   <o> GPIOF_1 [PTF1]<name=GPIOF_1_PIN_SEL>
//   <i> Shows which pin GPIOF_1 is mapped to
//     <0=> Disabled
//     <1=> PTF1<selection=PTF1_SIG_SEL,GPIOF_1>
//     <0=> Default
#define GPIOF_1_PIN_SEL      0
#if GPIOF_1_PIN_SEL == 1
#define GPIOF_1_GPIO         digitalIO_PTF1
#define GPIOF_1_FN           1
#endif

// Pin Mapping for GPIOF_2 signal
//   <o> GPIOF_2 [PTF2]<name=GPIOF_2_PIN_SEL>
//   <i> Shows which pin GPIOF_2 is mapped to
//     <0=> Disabled
//     <1=> PTF2<selection=PTF2_SIG_SEL,GPIOF_2>
//     <0=> Default
#define GPIOF_2_PIN_SEL      0
#if GPIOF_2_PIN_SEL == 1
#define GPIOF_2_GPIO         digitalIO_PTF2
#define GPIOF_2_FN           1
#endif

// Pin Mapping for GPIOF_3 signal
//   <o> GPIOF_3 [PTF3]<name=GPIOF_3_PIN_SEL>
//   <i> Shows which pin GPIOF_3 is mapped to
//     <0=> Disabled
//     <1=> PTF3<selection=PTF3_SIG_SEL,GPIOF_3>
//     <0=> Default
#define GPIOF_3_PIN_SEL      0
#if GPIOF_3_PIN_SEL == 1
#define GPIOF_3_GPIO         digitalIO_PTF3
#define GPIOF_3_FN           1
#endif

// Pin Mapping for GPIOF_4 signal
//   <o> GPIOF_4 [PTF4]<name=GPIOF_4_PIN_SEL>
//   <i> Shows which pin GPIOF_4 is mapped to
//     <0=> Disabled
//     <1=> PTF4<selection=PTF4_SIG_SEL,GPIOF_4>
//     <0=> Default
#define GPIOF_4_PIN_SEL      0
#if GPIOF_4_PIN_SEL == 1
#define GPIOF_4_GPIO         digitalIO_PTF4
#define GPIOF_4_FN           1
#endif

// Pin Mapping for GPIOF_5 signal
//   <o> GPIOF_5 [PTF5]<name=GPIOF_5_PIN_SEL>
//   <i> Shows which pin GPIOF_5 is mapped to
//     <0=> Disabled
//     <1=> PTF5<selection=PTF5_SIG_SEL,GPIOF_5>
//     <0=> Default
#define GPIOF_5_PIN_SEL      0
#if GPIOF_5_PIN_SEL == 1
#define GPIOF_5_GPIO         digitalIO_PTF5
#define GPIOF_5_FN           1
#endif

// Pin Mapping for GPIOF_6 signal
//   <o> GPIOF_6 [PTF6]<name=GPIOF_6_PIN_SEL>
//   <i> Shows which pin GPIOF_6 is mapped to
//     <0=> Disabled
//     <1=> PTF6<selection=PTF6_SIG_SEL,GPIOF_6>
//     <0=> Default
#define GPIOF_6_PIN_SEL      0
#if GPIOF_6_PIN_SEL == 1
#define GPIOF_6_GPIO         digitalIO_PTF6
#define GPIOF_6_FN           1
#endif

// Pin Mapping for GPIOF_7 signal
//   <o> GPIOF_7 [PTF7]<name=GPIOF_7_PIN_SEL>
//   <i> Shows which pin GPIOF_7 is mapped to
//     <0=> Disabled
//     <1=> PTF7<selection=PTF7_SIG_SEL,GPIOF_7>
//     <0=> Default
#define GPIOF_7_PIN_SEL      0
#if GPIOF_7_PIN_SEL == 1
#define GPIOF_7_GPIO         digitalIO_PTF7
#define GPIOF_7_FN           1
#endif

// </h>

// <h> General Purpose I/O (GPIOG)

// Pin Mapping for GPIOG_0 signal
//   <o> GPIOG_0 [PTG0]<name=GPIOG_0_PIN_SEL>
//   <i> Shows which pin GPIOG_0 is mapped to
//     <0=> Disabled
//     <1=> PTG0<selection=PTG0_SIG_SEL,GPIOG_0>
//     <0=> Default
#define GPIOG_0_PIN_SEL      0
#if GPIOG_0_PIN_SEL == 1
#define GPIOG_0_GPIO         digitalIO_PTG0
#define GPIOG_0_FN           1
#endif

// Pin Mapping for GPIOG_1 signal
//   <o> GPIOG_1 [PTG1]<name=GPIOG_1_PIN_SEL>
//   <i> Shows which pin GPIOG_1 is mapped to
//     <0=> Disabled
//     <1=> PTG1<selection=PTG1_SIG_SEL,GPIOG_1>
//     <0=> Default
#define GPIOG_1_PIN_SEL      0
#if GPIOG_1_PIN_SEL == 1
#define GPIOG_1_GPIO         digitalIO_PTG1
#define GPIOG_1_FN           1
#endif

// Pin Mapping for GPIOG_2 signal
//   <o> GPIOG_2 [PTG2]<name=GPIOG_2_PIN_SEL>
//   <i> Shows which pin GPIOG_2 is mapped to
//     <0=> Disabled
//     <1=> PTG2<selection=PTG2_SIG_SEL,GPIOG_2>
//     <0=> Default
#define GPIOG_2_PIN_SEL      0
#if GPIOG_2_PIN_SEL == 1
#define GPIOG_2_GPIO         digitalIO_PTG2
#define GPIOG_2_FN           1
#endif

// Pin Mapping for GPIOG_3 signal
//   <o> GPIOG_3 [PTG3]<name=GPIOG_3_PIN_SEL>
//   <i> Shows which pin GPIOG_3 is mapped to
//     <0=> Disabled
//     <1=> PTG3<selection=PTG3_SIG_SEL,GPIOG_3>
//     <0=> Default
#define GPIOG_3_PIN_SEL      0
#if GPIOG_3_PIN_SEL == 1
#define GPIOG_3_GPIO         digitalIO_PTG3
#define GPIOG_3_FN           1
#endif

// Pin Mapping for GPIOG_4 signal
//   <o> GPIOG_4 [PTG4]<name=GPIOG_4_PIN_SEL>
//   <i> Shows which pin GPIOG_4 is mapped to
//     <0=> Disabled
//     <1=> PTG4<selection=PTG4_SIG_SEL,GPIOG_4>
//     <0=> Default
#define GPIOG_4_PIN_SEL      0
#if GPIOG_4_PIN_SEL == 1
#define GPIOG_4_GPIO         digitalIO_PTG4
#define GPIOG_4_FN           1
#endif

