podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5.h
// Pin Mapping for GPIOG_5 signal
//   <o> GPIOG_5 [PTG5]<name=GPIOG_5_PIN_SEL>
//   <i> Shows which pin GPIOG_5 is mapped to
//     <0=> Disabled
//     <1=> PTG5<selection=PTG5_SIG_SEL,GPIOG_5>
//     <0=> Default
#define GPIOG_5_PIN_SEL      0
#if GPIOG_5_PIN_SEL == 1
#define GPIOG_5_GPIO         digitalIO_PTG5
#define GPIOG_5_FN           1
#endif

// Pin Mapping for GPIOG_6 signal
//   <o> GPIOG_6 [PTG6]<name=GPIOG_6_PIN_SEL>
//   <i> Shows which pin GPIOG_6 is mapped to
//     <0=> Disabled
//     <1=> PTG6<selection=PTG6_SIG_SEL,GPIOG_6>
//     <0=> Default
#define GPIOG_6_PIN_SEL      0
#if GPIOG_6_PIN_SEL == 1
#define GPIOG_6_GPIO         digitalIO_PTG6
#define GPIOG_6_FN           1
#endif

// Pin Mapping for GPIOG_7 signal
//   <o> GPIOG_7 [PTG7]<name=GPIOG_7_PIN_SEL>
//   <i> Shows which pin GPIOG_7 is mapped to
//     <0=> Disabled
//     <1=> PTG7<selection=PTG7_SIG_SEL,GPIOG_7>
//     <0=> Default
#define GPIOG_7_PIN_SEL      0
#if GPIOG_7_PIN_SEL == 1
#define GPIOG_7_GPIO         digitalIO_PTG7
#define GPIOG_7_FN           1
#endif

// </h>

// <h> General Purpose I/O (GPIOH)

// Pin Mapping for GPIOH_0 signal
//   <o> GPIOH_0 [PTH0]<name=GPIOH_0_PIN_SEL>
//   <i> Shows which pin GPIOH_0 is mapped to
//     <0=> Disabled
//     <1=> PTH0<selection=PTH0_SIG_SEL,GPIOH_0>
//     <0=> Default
#define GPIOH_0_PIN_SEL      0
#if GPIOH_0_PIN_SEL == 1
#define GPIOH_0_GPIO         digitalIO_PTH0
#define GPIOH_0_FN           1
#endif

// Pin Mapping for GPIOH_1 signal
//   <o> GPIOH_1 [PTH1]<name=GPIOH_1_PIN_SEL>
//   <i> Shows which pin GPIOH_1 is mapped to
//     <0=> Disabled
//     <1=> PTH1<selection=PTH1_SIG_SEL,GPIOH_1>
//     <0=> Default
#define GPIOH_1_PIN_SEL      0
#if GPIOH_1_PIN_SEL == 1
#define GPIOH_1_GPIO         digitalIO_PTH1
#define GPIOH_1_FN           1
#endif

// Pin Mapping for GPIOH_2 signal
//   <o> GPIOH_2 [PTH2]<name=GPIOH_2_PIN_SEL>
//   <i> Shows which pin GPIOH_2 is mapped to
//     <0=> Disabled
//     <1=> PTH2<selection=PTH2_SIG_SEL,GPIOH_2>
//     <0=> Default
#define GPIOH_2_PIN_SEL      0
#if GPIOH_2_PIN_SEL == 1
#define GPIOH_2_GPIO         digitalIO_PTH2
#define GPIOH_2_FN           1
#endif

// Pin Mapping for GPIOH_3 signal
//   <o> GPIOH_3 [PTH3]<name=GPIOH_3_PIN_SEL>
//   <i> Shows which pin GPIOH_3 is mapped to
//     <0=> Disabled
//     <1=> PTH3<selection=PTH3_SIG_SEL,GPIOH_3>
//     <0=> Default
#define GPIOH_3_PIN_SEL      0
#if GPIOH_3_PIN_SEL == 1
#define GPIOH_3_GPIO         digitalIO_PTH3
#define GPIOH_3_FN           1
#endif

// Pin Mapping for GPIOH_4 signal
//   <o> GPIOH_4 [PTH4]<name=GPIOH_4_PIN_SEL>
//   <i> Shows which pin GPIOH_4 is mapped to
//     <0=> Disabled
//     <1=> PTH4<selection=PTH4_SIG_SEL,GPIOH_4>
//     <0=> Default
#define GPIOH_4_PIN_SEL      0
#if GPIOH_4_PIN_SEL == 1
#define GPIOH_4_GPIO         digitalIO_PTH4
#define GPIOH_4_FN           1
#endif

// Pin Mapping for GPIOH_5 signal
//   <o> GPIOH_5 [PTH5]<name=GPIOH_5_PIN_SEL>
//   <i> Shows which pin GPIOH_5 is mapped to
//     <0=> Disabled
//     <1=> PTH5<selection=PTH5_SIG_SEL,GPIOH_5>
//     <0=> Default
#define GPIOH_5_PIN_SEL      0
#if GPIOH_5_PIN_SEL == 1
#define GPIOH_5_GPIO         digitalIO_PTH5
#define GPIOH_5_FN           1
#endif

// Pin Mapping for GPIOH_6 signal
//   <o> GPIOH_6 [PTH6]<name=GPIOH_6_PIN_SEL>
//   <i> Shows which pin GPIOH_6 is mapped to
//     <0=> Disabled
//     <1=> PTH6<selection=PTH6_SIG_SEL,GPIOH_6>
//     <0=> Default
#define GPIOH_6_PIN_SEL      0
#if GPIOH_6_PIN_SEL == 1
#define GPIOH_6_GPIO         digitalIO_PTH6
#define GPIOH_6_FN           1
#endif

// Pin Mapping for GPIOH_7 signal
//   <o> GPIOH_7 [PTH7]<name=GPIOH_7_PIN_SEL>
//   <i> Shows which pin GPIOH_7 is mapped to
//     <0=> Disabled
//     <1=> PTH7<selection=PTH7_SIG_SEL,GPIOH_7>
//     <0=> Default
#define GPIOH_7_PIN_SEL      0
#if GPIOH_7_PIN_SEL == 1
#define GPIOH_7_GPIO         digitalIO_PTH7
#define GPIOH_7_FN           1
#endif

// </h>

// <h> General Purpose I/O (GPIOI)

// Pin Mapping for GPIOI_0 signal
//   <o> GPIOI_0 [PTI0]<name=GPIOI_0_PIN_SEL>
//   <i> Shows which pin GPIOI_0 is mapped to
//     <0=> Disabled
//     <1=> PTI0<selection=PTI0_SIG_SEL,GPIOI_0>
//     <0=> Default
#define GPIOI_0_PIN_SEL      0
#if GPIOI_0_PIN_SEL == 1
#define GPIOI_0_GPIO         digitalIO_PTI0
#define GPIOI_0_FN           1
#endif

// Pin Mapping for GPIOI_1 signal
//   <o> GPIOI_1 [PTI1]<name=GPIOI_1_PIN_SEL>
//   <i> Shows which pin GPIOI_1 is mapped to
//     <0=> Disabled
//     <1=> PTI1<selection=PTI1_SIG_SEL,GPIOI_1>
//     <0=> Default
#define GPIOI_1_PIN_SEL      0
#if GPIOI_1_PIN_SEL == 1
#define GPIOI_1_GPIO         digitalIO_PTI1
#define GPIOI_1_FN           1
#endif

// Pin Mapping for GPIOI_2 signal
//   <o> GPIOI_2 [PTI2]<name=GPIOI_2_PIN_SEL>
//   <i> Shows which pin GPIOI_2 is mapped to
//     <0=> Disabled
//     <1=> PTI2<selection=PTI2_SIG_SEL,GPIOI_2>
//     <0=> Default
#define GPIOI_2_PIN_SEL      0
#if GPIOI_2_PIN_SEL == 1
#define GPIOI_2_GPIO         digitalIO_PTI2
#define GPIOI_2_FN           1
#endif

// Pin Mapping for GPIOI_3 signal
//   <o> GPIOI_3 [PTI3]<name=GPIOI_3_PIN_SEL>
//   <i> Shows which pin GPIOI_3 is mapped to
//     <0=> Disabled
//     <1=> PTI3<selection=PTI3_SIG_SEL,GPIOI_3>
//     <0=> Default
#define GPIOI_3_PIN_SEL      0
#if GPIOI_3_PIN_SEL == 1
#define GPIOI_3_GPIO         digitalIO_PTI3
#define GPIOI_3_FN           1
#endif

// </h>

// <h> Inter-Integrated Circuit (I2C0)

// Pin Mapping for I2C0_SCL signal
//   <o> I2C0_SCL [PTD7, PTG3, PTE6]<name=I2C0_SCL_PIN_SEL>
//   <i> Shows which pin I2C0_SCL is mapped to
//     <0=> Disabled
//     <1=> PTD7<selection=PTD7_SIG_SEL,I2C0_SCL>
//     <2=> PTG3<selection=PTG3_SIG_SEL,I2C0_SCL>
//     <3=> PTE6<selection=PTE6_SIG_SEL,I2C0_SCL>
//     <0=> Default
#define I2C0_SCL_PIN_SEL     0
#if I2C0_SCL_PIN_SEL == 1
#define I2C0_SCL_GPIO        digitalIO_PTD7
#define I2C0_SCL_FN          2
#elif I2C0_SCL_PIN_SEL == 2
#define I2C0_SCL_GPIO        digitalIO_PTG3
#define I2C0_SCL_FN          3
#elif I2C0_SCL_PIN_SEL == 3
#define I2C0_SCL_GPIO        digitalIO_PTE6
#define I2C0_SCL_FN          5
#endif

// Pin Mapping for I2C0_SDA signal
//   <o> I2C0_SDA [PTE0, PTG4, PTE7]<name=I2C0_SDA_PIN_SEL>
//   <i> Shows which pin I2C0_SDA is mapped to
//     <0=> Disabled
//     <1=> PTE0<selection=PTE0_SIG_SEL,I2C0_SDA>
//     <2=> PTG4<selection=PTG4_SIG_SEL,I2C0_SDA>
//     <3=> PTE7<selection=PTE7_SIG_SEL,I2C0_SDA>
//     <0=> Default
#define I2C0_SDA_PIN_SEL     0
#if I2C0_SDA_PIN_SEL == 1
#define I2C0_SDA_GPIO        digitalIO_PTE0
#define I2C0_SDA_FN          2
#elif I2C0_SDA_PIN_SEL == 2
#define I2C0_SDA_GPIO        digitalIO_PTG4
#define I2C0_SDA_FN          3
#elif I2C0_SDA_PIN_SEL == 3
#define I2C0_SDA_GPIO        digitalIO_PTE7
#define I2C0_SDA_FN          5
#endif

