podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5.h
// </h>

// <h> Inter-Integrated Circuit (I2C1)

// Pin Mapping for I2C1_SDA signal
//   <o> I2C1_SDA [PTF6, PTE2]<name=I2C1_SDA_PIN_SEL>
//   <i> Shows which pin I2C1_SDA is mapped to
//     <0=> Disabled
//     <1=> PTF6<selection=PTF6_SIG_SEL,I2C1_SDA>
//     <2=> PTE2<selection=PTE2_SIG_SEL,I2C1_SDA>
//     <0=> Default
#define I2C1_SDA_PIN_SEL     0
#if I2C1_SDA_PIN_SEL == 1
#define I2C1_SDA_GPIO        digitalIO_PTF6
#define I2C1_SDA_FN          3
#elif I2C1_SDA_PIN_SEL == 2
#define I2C1_SDA_GPIO        digitalIO_PTE2
#define I2C1_SDA_FN          4
#endif

// Pin Mapping for I2C1_SCL signal
//   <o> I2C1_SCL [PTF5, PTE3]<name=I2C1_SCL_PIN_SEL>
//   <i> Shows which pin I2C1_SCL is mapped to
//     <0=> Disabled
//     <1=> PTF5<selection=PTF5_SIG_SEL,I2C1_SCL>
//     <2=> PTE3<selection=PTE3_SIG_SEL,I2C1_SCL>
//     <0=> Default
#define I2C1_SCL_PIN_SEL     0
#if I2C1_SCL_PIN_SEL == 1
#define I2C1_SCL_GPIO        digitalIO_PTF5
#define I2C1_SCL_FN          3
#elif I2C1_SCL_PIN_SEL == 2
#define I2C1_SCL_GPIO        digitalIO_PTE3
#define I2C1_SCL_FN          4
#endif

// </h>

// <h> Low-Leakage Wake-up Unit (LLWU)

// Pin Mapping for LLWU_P0 signal
//   <o> LLWU_P0 [PTG6]<name=LLWU_P0_PIN_SEL>
//   <i> Shows which pin LLWU_P0 is mapped to
//     <0=> Disabled
//     <1=> PTG6<selection=PTG6_SIG_SEL,LLWU_P0>
//     <0=> Default
#define LLWU_P0_PIN_SEL      0
#if LLWU_P0_PIN_SEL == 1
#define LLWU_P0_GPIO         digitalIO_PTG6
#define LLWU_P0_FN           2
#endif

// Pin Mapping for LLWU_P1 signal
//   <o> LLWU_P1 [PTG2]<name=LLWU_P1_PIN_SEL>
//   <i> Shows which pin LLWU_P1 is mapped to
//     <0=> Disabled
//     <1=> PTG2<selection=PTG2_SIG_SEL,LLWU_P1>
//     <0=> Default
#define LLWU_P1_PIN_SEL      0
#if LLWU_P1_PIN_SEL == 1
#define LLWU_P1_GPIO         digitalIO_PTG2
#define LLWU_P1_FN           3
#endif

// Pin Mapping for LLWU_P2 signal
//   <o> LLWU_P2 [PTG1]<name=LLWU_P2_PIN_SEL>
//   <i> Shows which pin LLWU_P2 is mapped to
//     <0=> Disabled
//     <1=> PTG1<selection=PTG1_SIG_SEL,LLWU_P2>
//     <0=> Default
#define LLWU_P2_PIN_SEL      0
#if LLWU_P2_PIN_SEL == 1
#define LLWU_P2_GPIO         digitalIO_PTG1
#define LLWU_P2_FN           2
#endif

// Pin Mapping for LLWU_P3 signal
//   <o> LLWU_P3 [PTF6]<name=LLWU_P3_PIN_SEL>
//   <i> Shows which pin LLWU_P3 is mapped to
//     <0=> Disabled
//     <1=> PTF6<selection=PTF6_SIG_SEL,LLWU_P3>
//     <0=> Default
#define LLWU_P3_PIN_SEL      0
#if LLWU_P3_PIN_SEL == 1
#define LLWU_P3_GPIO         digitalIO_PTF6
#define LLWU_P3_FN           4
#endif

// Pin Mapping for LLWU_P4 signal
//   <o> LLWU_P4 [PTF0]<name=LLWU_P4_PIN_SEL>
//   <i> Shows which pin LLWU_P4 is mapped to
//     <0=> Disabled
//     <1=> PTF0<selection=PTF0_SIG_SEL,LLWU_P4>
//     <0=> Default
#define LLWU_P4_PIN_SEL      0
#if LLWU_P4_PIN_SEL == 1
#define LLWU_P4_GPIO         digitalIO_PTF0
#define LLWU_P4_FN           5
#endif

// Pin Mapping for LLWU_P5 signal
//   <o> LLWU_P5 [PTE6]<name=LLWU_P5_PIN_SEL>
//   <i> Shows which pin LLWU_P5 is mapped to
//     <0=> Disabled
//     <1=> PTE6<selection=PTE6_SIG_SEL,LLWU_P5>
//     <0=> Default
#define LLWU_P5_PIN_SEL      0
#if LLWU_P5_PIN_SEL == 1
#define LLWU_P5_GPIO         digitalIO_PTE6
#define LLWU_P5_FN           4
#endif

// Pin Mapping for LLWU_P6 signal
//   <o> LLWU_P6 [PTE5]<name=LLWU_P6_PIN_SEL>
//   <i> Shows which pin LLWU_P6 is mapped to
//     <0=> Disabled
//     <1=> PTE5<selection=PTE5_SIG_SEL,LLWU_P6>
//     <0=> Default
#define LLWU_P6_PIN_SEL      0
#if LLWU_P6_PIN_SEL == 1
#define LLWU_P6_GPIO         digitalIO_PTE5
#define LLWU_P6_FN           5
#endif

// Pin Mapping for LLWU_P7 signal
//   <o> LLWU_P7 [PTD7]<name=LLWU_P7_PIN_SEL>
//   <i> Shows which pin LLWU_P7 is mapped to
//     <0=> Disabled
//     <1=> PTD7<selection=PTD7_SIG_SEL,LLWU_P7>
//     <0=> Default
#define LLWU_P7_PIN_SEL      0
#if LLWU_P7_PIN_SEL == 1
#define LLWU_P7_GPIO         digitalIO_PTD7
#define LLWU_P7_FN           5
#endif

// Pin Mapping for LLWU_P8 signal
//   <o> LLWU_P8 [PTD6]<name=LLWU_P8_PIN_SEL>
//   <i> Shows which pin LLWU_P8 is mapped to
//     <0=> Disabled
//     <1=> PTD6<selection=PTD6_SIG_SEL,LLWU_P8>
//     <0=> Default
#define LLWU_P8_PIN_SEL      0
#if LLWU_P8_PIN_SEL == 1
#define LLWU_P8_GPIO         digitalIO_PTD6
#define LLWU_P8_FN           5
#endif

// Pin Mapping for LLWU_P9 signal
//   <o> LLWU_P9 [PTD4]<name=LLWU_P9_PIN_SEL>
//   <i> Shows which pin LLWU_P9 is mapped to
//     <0=> Disabled
//     <1=> PTD4<selection=PTD4_SIG_SEL,LLWU_P9>
//     <0=> Default
#define LLWU_P9_PIN_SEL      0
#if LLWU_P9_PIN_SEL == 1
#define LLWU_P9_GPIO         digitalIO_PTD4
#define LLWU_P9_FN           4
#endif

// Pin Mapping for LLWU_P10 signal
//   <o> LLWU_P10 [PTD2]<name=LLWU_P10_PIN_SEL>
//   <i> Shows which pin LLWU_P10 is mapped to
//     <0=> Disabled
//     <1=> PTD2<selection=PTD2_SIG_SEL,LLWU_P10>
//     <0=> Default
#define LLWU_P10_PIN_SEL     0
#if LLWU_P10_PIN_SEL == 1
#define LLWU_P10_GPIO        digitalIO_PTD2
#define LLWU_P10_FN          5
#endif

// Pin Mapping for LLWU_P11 signal
//   <o> LLWU_P11 [PTD0]<name=LLWU_P11_PIN_SEL>
//   <i> Shows which pin LLWU_P11 is mapped to
//     <0=> Disabled
//     <1=> PTD0<selection=PTD0_SIG_SEL,LLWU_P11>
//     <0=> Default
#define LLWU_P11_PIN_SEL     0
#if LLWU_P11_PIN_SEL == 1
#define LLWU_P11_GPIO        digitalIO_PTD0
#define LLWU_P11_FN          4
#endif

// Pin Mapping for LLWU_P12 signal
//   <o> LLWU_P12 [PTC5]<name=LLWU_P12_PIN_SEL>
//   <i> Shows which pin LLWU_P12 is mapped to
//     <0=> Disabled
//     <1=> PTC5<selection=PTC5_SIG_SEL,LLWU_P12>
//     <0=> Default
#define LLWU_P12_PIN_SEL     0
#if LLWU_P12_PIN_SEL == 1
#define LLWU_P12_GPIO        digitalIO_PTC5
#define LLWU_P12_FN          3
#endif

// Pin Mapping for LLWU_P13 signal
//   <o> LLWU_P13 [PTC3]<name=LLWU_P13_PIN_SEL>
//   <i> Shows which pin LLWU_P13 is mapped to
//     <0=> Disabled
//     <1=> PTC3<selection=PTC3_SIG_SEL,LLWU_P13>
//     <0=> Default
#define LLWU_P13_PIN_SEL     0
#if LLWU_P13_PIN_SEL == 1
#define LLWU_P13_GPIO        digitalIO_PTC3
#define LLWU_P13_FN          3
#endif

// Pin Mapping for LLWU_P14 signal
//   <o> LLWU_P14 [PTA6]<name=LLWU_P14_PIN_SEL>
//   <i> Shows which pin LLWU_P14 is mapped to
//     <0=> Disabled
//     <1=> PTA6<selection=PTA6_SIG_SEL,LLWU_P14>
//     <0=> Default
#define LLWU_P14_PIN_SEL     0
#if LLWU_P14_PIN_SEL == 1
#define LLWU_P14_GPIO        digitalIO_PTA6
#define LLWU_P14_FN          3
#endif

