podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5.h
// Pin Mapping for LLWU_P15 signal
//   <o> LLWU_P15 [PTA4]<name=LLWU_P15_PIN_SEL>
//   <i> Shows which pin LLWU_P15 is mapped to
//     <0=> Disabled
//     <1=> PTA4<selection=PTA4_SIG_SEL,LLWU_P15>
//     <0=> Default
#define LLWU_P15_PIN_SEL     0
#if LLWU_P15_PIN_SEL == 1
#define LLWU_P15_GPIO        digitalIO_PTA4
#define LLWU_P15_FN          2
#endif

// </h>

// <h> Low Power Timer (LPTMR)

// Pin Mapping for LPTMR_ALT0 signal
//   <o> LPTMR_ALT0 [PTE4, PTF4, PTG1]<name=LPTMR_ALT0_PIN_SEL>
//   <i> Shows which pin LPTMR_ALT0 is mapped to
//     <0=> Disabled
//     <1=> PTE4<selection=PTE4_SIG_SEL,LPTMR_ALT0>
//     <2=> PTF4<selection=PTF4_SIG_SEL,LPTMR_ALT0>
//     <3=> PTG1<selection=PTG1_SIG_SEL,LPTMR_ALT0>
//     <0=> Default
#define LPTMR_ALT0_PIN_SEL   0
#if LPTMR_ALT0_PIN_SEL == 1
#define LPTMR_ALT0_GPIO      digitalIO_PTE4
#define LPTMR_ALT0_FN        2
#elif LPTMR_ALT0_PIN_SEL == 2
#define LPTMR_ALT0_GPIO      digitalIO_PTF4
#define LPTMR_ALT0_FN        3
#elif LPTMR_ALT0_PIN_SEL == 3
#define LPTMR_ALT0_GPIO      digitalIO_PTG1
#define LPTMR_ALT0_FN        3
#endif

// Pin Mapping for LPTMR_ALT1 signal
//   <o> LPTMR_ALT1 [PTD6, PTF3, PTG5]<name=LPTMR_ALT1_PIN_SEL>
//   <i> Shows which pin LPTMR_ALT1 is mapped to
//     <0=> Disabled
//     <1=> PTD6<selection=PTD6_SIG_SEL,LPTMR_ALT1>
//     <2=> PTF3<selection=PTF3_SIG_SEL,LPTMR_ALT1>
//     <3=> PTG5<selection=PTG5_SIG_SEL,LPTMR_ALT1>
//     <0=> Default
#define LPTMR_ALT1_PIN_SEL   0
#if LPTMR_ALT1_PIN_SEL == 1
#define LPTMR_ALT1_GPIO      digitalIO_PTD6
#define LPTMR_ALT1_FN        2
#elif LPTMR_ALT1_PIN_SEL == 2
#define LPTMR_ALT1_GPIO      digitalIO_PTF3
#define LPTMR_ALT1_FN        3
#elif LPTMR_ALT1_PIN_SEL == 3
#define LPTMR_ALT1_GPIO      digitalIO_PTG5
#define LPTMR_ALT1_FN        3
#endif

// Pin Mapping for LPTMR_ALT2 signal
//   <o> LPTMR_ALT2 [PTD5, PTG0, PTG6]<name=LPTMR_ALT2_PIN_SEL>
//   <i> Shows which pin LPTMR_ALT2 is mapped to
//     <0=> Disabled
//     <1=> PTD5<selection=PTD5_SIG_SEL,LPTMR_ALT2>
//     <2=> PTG0<selection=PTG0_SIG_SEL,LPTMR_ALT2>
//     <3=> PTG6<selection=PTG6_SIG_SEL,LPTMR_ALT2>
//     <0=> Default
#define LPTMR_ALT2_PIN_SEL   0
#if LPTMR_ALT2_PIN_SEL == 1
#define LPTMR_ALT2_GPIO      digitalIO_PTD5
#define LPTMR_ALT2_FN        2
#elif LPTMR_ALT2_PIN_SEL == 2
#define LPTMR_ALT2_GPIO      digitalIO_PTG0
#define LPTMR_ALT2_FN        3
#elif LPTMR_ALT2_PIN_SEL == 3
#define LPTMR_ALT2_GPIO      digitalIO_PTG6
#define LPTMR_ALT2_FN        3
#endif

// </h>

// <h> Debug and Control

// Pin Mapping for NMI_B signal
//   <o> NMI_B [PTA4]<name=NMI_B_PIN_SEL>
//   <i> Shows which pin NMI_B is mapped to
//     <0=> Disabled
//     <1=> PTA4 (reset default)<selection=PTA4_SIG_SEL,NMI_B (reset default)>
//     <2=> PTA4<selection=PTA4_SIG_SEL,NMI_B>
//     <1=> Default
#define NMI_B_PIN_SEL        1
#if NMI_B_PIN_SEL == 2
#define NMI_B_GPIO           digitalIO_PTA4
#define NMI_B_FN             7
#endif

// Pin Mapping for RESET_B signal
//   <o> RESET_B [PTE1]<name=RESET_B_PIN_SEL>
//   <i> Shows which pin RESET_B is mapped to
//     <0=> Disabled
//     <1=> PTE1 (reset default)<selection=PTE1_SIG_SEL,RESET_B (reset default)>
//     <2=> PTE1<selection=PTE1_SIG_SEL,RESET_B>
//     <1=> Default
#define RESET_B_PIN_SEL      1
#if RESET_B_PIN_SEL == 2
#define RESET_B_GPIO         digitalIO_PTE1
#define RESET_B_FN           7
#endif

// Pin Mapping for SWD_CLK signal
//   <o> SWD_CLK [PTE7]<name=SWD_CLK_PIN_SEL>
//   <i> Shows which pin SWD_CLK is mapped to
//     <0=> Disabled
//     <1=> PTE7 (reset default)<selection=PTE7_SIG_SEL,SWD_CLK (reset default)>
//     <2=> PTE7<selection=PTE7_SIG_SEL,SWD_CLK>
//     <1=> Default
#define SWD_CLK_PIN_SEL      1
#if SWD_CLK_PIN_SEL == 2
#define SWD_CLK_GPIO         digitalIO_PTE7
#define SWD_CLK_FN           7
#endif

// Pin Mapping for SWD_IO signal
//   <o> SWD_IO [PTE6]<name=SWD_IO_PIN_SEL>
//   <i> Shows which pin SWD_IO is mapped to
//     <0=> Disabled
//     <1=> PTE6 (reset default)<selection=PTE6_SIG_SEL,SWD_IO (reset default)>
//     <2=> PTE6<selection=PTE6_SIG_SEL,SWD_IO>
//     <1=> Default
#define SWD_IO_PIN_SEL       1
#if SWD_IO_PIN_SEL == 2
#define SWD_IO_GPIO          digitalIO_PTE6
#define SWD_IO_FN            7
#endif

// </h>

// <h> (PXBAR)

// Pin Mapping for PXBAR_IN0 signal
//   <o> PXBAR_IN0 [PTA6]<name=PXBAR_IN0_PIN_SEL>
//   <i> Shows which pin PXBAR_IN0 is mapped to
//     <0=> Disabled
//     <1=> PTA6<selection=PTA6_SIG_SEL,PXBAR_IN0>
//     <0=> Default
#define PXBAR_IN0_PIN_SEL    0
#if PXBAR_IN0_PIN_SEL == 1
#define PXBAR_IN0_GPIO       digitalIO_PTA6
#define PXBAR_IN0_FN         2
#endif

// Pin Mapping for PXBAR_IN1 signal
//   <o> PXBAR_IN1 [PTC0]<name=PXBAR_IN1_PIN_SEL>
//   <i> Shows which pin PXBAR_IN1 is mapped to
//     <0=> Disabled
//     <1=> PTC0<selection=PTC0_SIG_SEL,PXBAR_IN1>
//     <0=> Default
#define PXBAR_IN1_PIN_SEL    0
#if PXBAR_IN1_PIN_SEL == 1
#define PXBAR_IN1_GPIO       digitalIO_PTC0
#define PXBAR_IN1_FN         3
#endif

// Pin Mapping for PXBAR_IN2 signal
//   <o> PXBAR_IN2 [PTD0]<name=PXBAR_IN2_PIN_SEL>
//   <i> Shows which pin PXBAR_IN2 is mapped to
//     <0=> Disabled
//     <1=> PTD0<selection=PTD0_SIG_SEL,PXBAR_IN2>
//     <0=> Default
#define PXBAR_IN2_PIN_SEL    0
#if PXBAR_IN2_PIN_SEL == 1
#define PXBAR_IN2_GPIO       digitalIO_PTD0
#define PXBAR_IN2_FN         3
#endif

// Pin Mapping for PXBAR_IN3 signal
//   <o> PXBAR_IN3 [PTD2]<name=PXBAR_IN3_PIN_SEL>
//   <i> Shows which pin PXBAR_IN3 is mapped to
//     <0=> Disabled
//     <1=> PTD2<selection=PTD2_SIG_SEL,PXBAR_IN3>
//     <0=> Default
#define PXBAR_IN3_PIN_SEL    0
#if PXBAR_IN3_PIN_SEL == 1
#define PXBAR_IN3_GPIO       digitalIO_PTD2
#define PXBAR_IN3_FN         4
#endif

// Pin Mapping for PXBAR_IN4 signal
//   <o> PXBAR_IN4 [PTD7]<name=PXBAR_IN4_PIN_SEL>
//   <i> Shows which pin PXBAR_IN4 is mapped to
//     <0=> Disabled
//     <1=> PTD7<selection=PTD7_SIG_SEL,PXBAR_IN4>
//     <0=> Default
#define PXBAR_IN4_PIN_SEL    0
#if PXBAR_IN4_PIN_SEL == 1
#define PXBAR_IN4_GPIO       digitalIO_PTD7
#define PXBAR_IN4_FN         3
#endif

// Pin Mapping for PXBAR_IN5 signal
//   <o> PXBAR_IN5 [PTE6]<name=PXBAR_IN5_PIN_SEL>
//   <i> Shows which pin PXBAR_IN5 is mapped to
//     <0=> Disabled
//     <1=> PTE6<selection=PTE6_SIG_SEL,PXBAR_IN5>
//     <0=> Default
#define PXBAR_IN5_PIN_SEL    0
#if PXBAR_IN5_PIN_SEL == 1
#define PXBAR_IN5_GPIO       digitalIO_PTE6
#define PXBAR_IN5_FN         2
#endif

// Pin Mapping for PXBAR_IN6 signal
//   <o> PXBAR_IN6 [PTE2]<name=PXBAR_IN6_PIN_SEL>
//   <i> Shows which pin PXBAR_IN6 is mapped to
//     <0=> Disabled
//     <1=> PTE2<selection=PTE2_SIG_SEL,PXBAR_IN6>
//     <0=> Default
#define PXBAR_IN6_PIN_SEL    0
#if PXBAR_IN6_PIN_SEL == 1
#define PXBAR_IN6_GPIO       digitalIO_PTE2
#define PXBAR_IN6_FN         3
#endif

// Pin Mapping for PXBAR_IN7 signal
//   <o> PXBAR_IN7 [PTH6]<name=PXBAR_IN7_PIN_SEL>
//   <i> Shows which pin PXBAR_IN7 is mapped to
//     <0=> Disabled
//     <1=> PTH6<selection=PTH6_SIG_SEL,PXBAR_IN7>
//     <0=> Default
#define PXBAR_IN7_PIN_SEL    0
#if PXBAR_IN7_PIN_SEL == 1
#define PXBAR_IN7_GPIO       digitalIO_PTH6
#define PXBAR_IN7_FN         4
#endif

// Pin Mapping for PXBAR_IN8 signal
//   <o> PXBAR_IN8 [PTI0]<name=PXBAR_IN8_PIN_SEL>
//   <i> Shows which pin PXBAR_IN8 is mapped to
//     <0=> Disabled
//     <1=> PTI0<selection=PTI0_SIG_SEL,PXBAR_IN8>
//     <0=> Default
#define PXBAR_IN8_PIN_SEL    0
#if PXBAR_IN8_PIN_SEL == 1
#define PXBAR_IN8_GPIO       digitalIO_PTI0
#define PXBAR_IN8_FN         3
#endif

// Pin Mapping for PXBAR_OUT0 signal
//   <o> PXBAR_OUT0 [PTA7]<name=PXBAR_OUT0_PIN_SEL>
//   <i> Shows which pin PXBAR_OUT0 is mapped to
//     <0=> Disabled
//     <1=> PTA7<selection=PTA7_SIG_SEL,PXBAR_OUT0>
//     <0=> Default
#define PXBAR_OUT0_PIN_SEL   0
#if PXBAR_OUT0_PIN_SEL == 1
#define PXBAR_OUT0_GPIO      digitalIO_PTA7
#define PXBAR_OUT0_FN        2
#endif

// Pin Mapping for PXBAR_OUT1 signal
//   <o> PXBAR_OUT1 [PTC2]<name=PXBAR_OUT1_PIN_SEL>
//   <i> Shows which pin PXBAR_OUT1 is mapped to
//     <0=> Disabled
//     <1=> PTC2<selection=PTC2_SIG_SEL,PXBAR_OUT1>
//     <0=> Default
#define PXBAR_OUT1_PIN_SEL   0
#if PXBAR_OUT1_PIN_SEL == 1
#define PXBAR_OUT1_GPIO      digitalIO_PTC2
#define PXBAR_OUT1_FN        3
#endif

// Pin Mapping for PXBAR_OUT2 signal
//   <o> PXBAR_OUT2 [PTC7]<name=PXBAR_OUT2_PIN_SEL>
//   <i> Shows which pin PXBAR_OUT2 is mapped to
//     <0=> Disabled
//     <1=> PTC7<selection=PTC7_SIG_SEL,PXBAR_OUT2>
//     <0=> Default
#define PXBAR_OUT2_PIN_SEL   0
#if PXBAR_OUT2_PIN_SEL == 1
#define PXBAR_OUT2_GPIO      digitalIO_PTC7
#define PXBAR_OUT2_FN        3
#endif

