podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5.h
// Pin Mapping for PXBAR_OUT3 signal
//   <o> PXBAR_OUT3 [PTD1]<name=PXBAR_OUT3_PIN_SEL>
//   <i> Shows which pin PXBAR_OUT3 is mapped to
//     <0=> Disabled
//     <1=> PTD1 (Alias:LED_BLUE)<selection=PTD1_SIG_SEL,PXBAR_OUT3>
//     <0=> Default
#define PXBAR_OUT3_PIN_SEL   0
#if PXBAR_OUT3_PIN_SEL == 1
#define PXBAR_OUT3_GPIO      digitalIO_PTD1
#define PXBAR_OUT3_FN        4
#endif

// Pin Mapping for PXBAR_OUT4 signal
//   <o> PXBAR_OUT4 [PTE0]<name=PXBAR_OUT4_PIN_SEL>
//   <i> Shows which pin PXBAR_OUT4 is mapped to
//     <0=> Disabled
//     <1=> PTE0<selection=PTE0_SIG_SEL,PXBAR_OUT4>
//     <0=> Default
#define PXBAR_OUT4_PIN_SEL   0
#if PXBAR_OUT4_PIN_SEL == 1
#define PXBAR_OUT4_GPIO      digitalIO_PTE0
#define PXBAR_OUT4_FN        3
#endif

// Pin Mapping for PXBAR_OUT5 signal
//   <o> PXBAR_OUT5 [PTE7]<name=PXBAR_OUT5_PIN_SEL>
//   <i> Shows which pin PXBAR_OUT5 is mapped to
//     <0=> Disabled
//     <1=> PTE7<selection=PTE7_SIG_SEL,PXBAR_OUT5>
//     <0=> Default
#define PXBAR_OUT5_PIN_SEL   0
#if PXBAR_OUT5_PIN_SEL == 1
#define PXBAR_OUT5_GPIO      digitalIO_PTE7
#define PXBAR_OUT5_FN        2
#endif

// Pin Mapping for PXBAR_OUT6 signal
//   <o> PXBAR_OUT6 [PTF1]<name=PXBAR_OUT6_PIN_SEL>
//   <i> Shows which pin PXBAR_OUT6 is mapped to
//     <0=> Disabled
//     <1=> PTF1<selection=PTF1_SIG_SEL,PXBAR_OUT6>
//     <0=> Default
#define PXBAR_OUT6_PIN_SEL   0
#if PXBAR_OUT6_PIN_SEL == 1
#define PXBAR_OUT6_GPIO      digitalIO_PTF1
#define PXBAR_OUT6_FN        3
#endif

// Pin Mapping for PXBAR_OUT7 signal
//   <o> PXBAR_OUT7 [PTH7]<name=PXBAR_OUT7_PIN_SEL>
//   <i> Shows which pin PXBAR_OUT7 is mapped to
//     <0=> Disabled
//     <1=> PTH7<selection=PTH7_SIG_SEL,PXBAR_OUT7>
//     <0=> Default
#define PXBAR_OUT7_PIN_SEL   0
#if PXBAR_OUT7_PIN_SEL == 1
#define PXBAR_OUT7_GPIO      digitalIO_PTH7
#define PXBAR_OUT7_FN        4
#endif

// Pin Mapping for PXBAR_OUT8 signal
//   <o> PXBAR_OUT8 [PTI1]<name=PXBAR_OUT8_PIN_SEL>
//   <i> Shows which pin PXBAR_OUT8 is mapped to
//     <0=> Disabled
//     <1=> PTI1<selection=PTI1_SIG_SEL,PXBAR_OUT8>
//     <0=> Default
#define PXBAR_OUT8_PIN_SEL   0
#if PXBAR_OUT8_PIN_SEL == 1
#define PXBAR_OUT8_GPIO      digitalIO_PTI1
#define PXBAR_OUT8_FN        3
#endif

// </h>

// <h> (QT)

// Pin Mapping for QT0 signal
//   <o> QT0 [PTF1, PTD5]<name=QT0_PIN_SEL>
//   <i> Shows which pin QT0 is mapped to
//     <0=> Disabled
//     <1=> PTF1<selection=PTF1_SIG_SEL,QT0>
//     <2=> PTD5<selection=PTD5_SIG_SEL,QT0>
//     <0=> Default
#define QT0_PIN_SEL          0
#if QT0_PIN_SEL == 1
#define QT0_GPIO             digitalIO_PTF1
#define QT0_FN               2
#elif QT0_PIN_SEL == 2
#define QT0_GPIO             digitalIO_PTD5
#define QT0_FN               3
#endif

// Pin Mapping for QT1 signal
//   <o> QT1 [PTG0, PTC6]<name=QT1_PIN_SEL>
//   <i> Shows which pin QT1 is mapped to
//     <0=> Disabled
//     <1=> PTG0<selection=PTG0_SIG_SEL,QT1>
//     <2=> PTC6<selection=PTC6_SIG_SEL,QT1>
//     <0=> Default
#define QT1_PIN_SEL          0
#if QT1_PIN_SEL == 1
#define QT1_GPIO             digitalIO_PTG0
#define QT1_FN               2
#elif QT1_PIN_SEL == 2
#define QT1_GPIO             digitalIO_PTC6
#define QT1_FN               3
#endif

// Pin Mapping for QT2 signal
//   <o> QT2 [PTF7, PTF0]<name=QT2_PIN_SEL>
//   <i> Shows which pin QT2 is mapped to
//     <0=> Disabled
//     <1=> PTF7<selection=PTF7_SIG_SEL,QT2>
//     <2=> PTF0<selection=PTF0_SIG_SEL,QT2>
//     <0=> Default
#define QT2_PIN_SEL          0
#if QT2_PIN_SEL == 1
#define QT2_GPIO             digitalIO_PTF7
#define QT2_FN               2
#elif QT2_PIN_SEL == 2
#define QT2_GPIO             digitalIO_PTF0
#define QT2_FN               3
#endif

// Pin Mapping for QT3 signal
//   <o> QT3 [PTE5, PTD1]<name=QT3_PIN_SEL>
//   <i> Shows which pin QT3 is mapped to
//     <0=> Disabled
//     <1=> PTE5<selection=PTE5_SIG_SEL,QT3>
//     <2=> PTD1 (Alias:LED_BLUE)<selection=PTD1_SIG_SEL,QT3>
//     <0=> Default
#define QT3_PIN_SEL          0
#if QT3_PIN_SEL == 1
#define QT3_GPIO             digitalIO_PTE5
#define QT3_FN               2
#elif QT3_PIN_SEL == 2
#define QT3_GPIO             digitalIO_PTD1
#define QT3_FN               5
#endif

// </h>

// <h> Serial Communication Interface (SCI0)

// Pin Mapping for SCI0_CTS signal
//   <o> SCI0_CTS [PTC6]<name=SCI0_CTS_PIN_SEL>
//   <i> Shows which pin SCI0_CTS is mapped to
//     <0=> Disabled
//     <1=> PTC6<selection=PTC6_SIG_SEL,SCI0_CTS>
//     <0=> Default
#define SCI0_CTS_PIN_SEL     0
#if SCI0_CTS_PIN_SEL == 1
#define SCI0_CTS_GPIO        digitalIO_PTC6
#define SCI0_CTS_FN          2
#endif

// Pin Mapping for SCI0_RTS signal
//   <o> SCI0_RTS [PTC5]<name=SCI0_RTS_PIN_SEL>
//   <i> Shows which pin SCI0_RTS is mapped to
//     <0=> Disabled
//     <1=> PTC5<selection=PTC5_SIG_SEL,SCI0_RTS>
//     <0=> Default
#define SCI0_RTS_PIN_SEL     0
#if SCI0_RTS_PIN_SEL == 1
#define SCI0_RTS_GPIO        digitalIO_PTC5
#define SCI0_RTS_FN          2
#endif

// Pin Mapping for SCI0_RxD signal
//   <o> SCI0_RxD [PTD0, PTF3]<name=SCI0_RxD_PIN_SEL>
//   <i> Shows which pin SCI0_RxD is mapped to
//     <0=> Disabled
//     <1=> PTD0<selection=PTD0_SIG_SEL,SCI0_RxD>
//     <2=> PTF3<selection=PTF3_SIG_SEL,SCI0_RxD>
//     <0=> Default
#define SCI0_RxD_PIN_SEL     0
#if SCI0_RxD_PIN_SEL == 1
#define SCI0_RxD_GPIO        digitalIO_PTD0
#define SCI0_RxD_FN          2
#elif SCI0_RxD_PIN_SEL == 2
#define SCI0_RxD_GPIO        digitalIO_PTF3
#define SCI0_RxD_FN          4
#endif

// Pin Mapping for SCI0_TxD signal
//   <o> SCI0_TxD [PTC7, PTF4]<name=SCI0_TxD_PIN_SEL>
//   <i> Shows which pin SCI0_TxD is mapped to
//     <0=> Disabled
//     <1=> PTC7<selection=PTC7_SIG_SEL,SCI0_TxD>
//     <2=> PTF4<selection=PTF4_SIG_SEL,SCI0_TxD>
//     <0=> Default
#define SCI0_TxD_PIN_SEL     0
#if SCI0_TxD_PIN_SEL == 1
#define SCI0_TxD_GPIO        digitalIO_PTC7
#define SCI0_TxD_FN          2
#elif SCI0_TxD_PIN_SEL == 2
#define SCI0_TxD_GPIO        digitalIO_PTF4
#define SCI0_TxD_FN          4
#endif

