podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5.h
// </h>

// <h> Serial Communication Interface (SCI1)

// Pin Mapping for SCI1_CTS signal
//   <o> SCI1_CTS [PTD3, PTH6]<name=SCI1_CTS_PIN_SEL>
//   <i> Shows which pin SCI1_CTS is mapped to
//     <0=> Disabled
//     <1=> PTD3<selection=PTD3_SIG_SEL,SCI1_CTS>
//     <2=> PTH6<selection=PTH6_SIG_SEL,SCI1_CTS>
//     <0=> Default
#define SCI1_CTS_PIN_SEL     0
#if SCI1_CTS_PIN_SEL == 1
#define SCI1_CTS_GPIO        digitalIO_PTD3
#define SCI1_CTS_FN          2
#elif SCI1_CTS_PIN_SEL == 2
#define SCI1_CTS_GPIO        digitalIO_PTH6
#define SCI1_CTS_FN          2
#endif

// Pin Mapping for SCI1_RTS signal
//   <o> SCI1_RTS [PTD4, PTH7]<name=SCI1_RTS_PIN_SEL>
//   <i> Shows which pin SCI1_RTS is mapped to
//     <0=> Disabled
//     <1=> PTD4<selection=PTD4_SIG_SEL,SCI1_RTS>
//     <2=> PTH7<selection=PTH7_SIG_SEL,SCI1_RTS>
//     <0=> Default
#define SCI1_RTS_PIN_SEL     0
#if SCI1_RTS_PIN_SEL == 1
#define SCI1_RTS_GPIO        digitalIO_PTD4
#define SCI1_RTS_FN          2
#elif SCI1_RTS_PIN_SEL == 2
#define SCI1_RTS_GPIO        digitalIO_PTH7
#define SCI1_RTS_FN          2
#endif

// Pin Mapping for SCI1_RxD signal
//   <o> SCI1_RxD [PTD2, PTI0]<name=SCI1_RxD_PIN_SEL>
//   <i> Shows which pin SCI1_RxD is mapped to
//     <0=> Disabled
//     <1=> PTD2<selection=PTD2_SIG_SEL,SCI1_RxD>
//     <2=> PTI0<selection=PTI0_SIG_SEL,SCI1_RxD>
//     <0=> Default
#define SCI1_RxD_PIN_SEL     0
#if SCI1_RxD_PIN_SEL == 1
#define SCI1_RxD_GPIO        digitalIO_PTD2
#define SCI1_RxD_FN          2
#elif SCI1_RxD_PIN_SEL == 2
#define SCI1_RxD_GPIO        digitalIO_PTI0
#define SCI1_RxD_FN          2
#endif

// Pin Mapping for SCI1_TxD signal
//   <o> SCI1_TxD [PTD1, PTI1]<name=SCI1_TxD_PIN_SEL>
//   <i> Shows which pin SCI1_TxD is mapped to
//     <0=> Disabled
//     <1=> PTD1 (Alias:LED_BLUE)<selection=PTD1_SIG_SEL,SCI1_TxD>
//     <2=> PTI1<selection=PTI1_SIG_SEL,SCI1_TxD>
//     <0=> Default
#define SCI1_TxD_PIN_SEL     0
#if SCI1_TxD_PIN_SEL == 1
#define SCI1_TxD_GPIO        digitalIO_PTD1
#define SCI1_TxD_FN          2
#elif SCI1_TxD_PIN_SEL == 2
#define SCI1_TxD_GPIO        digitalIO_PTI1
#define SCI1_TxD_FN          2
#endif

// </h>

// <h> Serial Communication Interface (SCI2)

// Pin Mapping for SCI2_CTS signal
//   <o> SCI2_CTS [PTE4]<name=SCI2_CTS_PIN_SEL>
//   <i> Shows which pin SCI2_CTS is mapped to
//     <0=> Disabled
//     <1=> PTE4<selection=PTE4_SIG_SEL,SCI2_CTS>
//     <0=> Default
#define SCI2_CTS_PIN_SEL     0
#if SCI2_CTS_PIN_SEL == 1
#define SCI2_CTS_GPIO        digitalIO_PTE4
#define SCI2_CTS_FN          3
#endif

// Pin Mapping for SCI2_RTS signal
//   <o> SCI2_RTS [PTE5]<name=SCI2_RTS_PIN_SEL>
//   <i> Shows which pin SCI2_RTS is mapped to
//     <0=> Disabled
//     <1=> PTE5<selection=PTE5_SIG_SEL,SCI2_RTS>
//     <0=> Default
#define SCI2_RTS_PIN_SEL     0
#if SCI2_RTS_PIN_SEL == 1
#define SCI2_RTS_GPIO        digitalIO_PTE5
#define SCI2_RTS_FN          3
#endif

// Pin Mapping for SCI2_RxD signal
//   <o> SCI2_RxD [PTE6]<name=SCI2_RxD_PIN_SEL>
//   <i> Shows which pin SCI2_RxD is mapped to
//     <0=> Disabled
//     <1=> PTE6<selection=PTE6_SIG_SEL,SCI2_RxD>
//     <0=> Default
#define SCI2_RxD_PIN_SEL     0
#if SCI2_RxD_PIN_SEL == 1
#define SCI2_RxD_GPIO        digitalIO_PTE6
#define SCI2_RxD_FN          3
#endif

// Pin Mapping for SCI2_TxD signal
//   <o> SCI2_TxD [PTE7]<name=SCI2_TxD_PIN_SEL>
//   <i> Shows which pin SCI2_TxD is mapped to
//     <0=> Disabled
//     <1=> PTE7<selection=PTE7_SIG_SEL,SCI2_TxD>
//     <0=> Default
#define SCI2_TxD_PIN_SEL     0
#if SCI2_TxD_PIN_SEL == 1
#define SCI2_TxD_GPIO        digitalIO_PTE7
#define SCI2_TxD_FN          3
#endif

// </h>

// <h> Serial Communication Interface (SCI3)

// Pin Mapping for SCI3_CTS signal
//   <o> SCI3_CTS [PTC1, PTD5]<name=SCI3_CTS_PIN_SEL>
//   <i> Shows which pin SCI3_CTS is mapped to
//     <0=> Disabled
//     <1=> PTC1<selection=PTC1_SIG_SEL,SCI3_CTS>
//     <2=> PTD5<selection=PTD5_SIG_SEL,SCI3_CTS>
//     <0=> Default
#define SCI3_CTS_PIN_SEL     0
#if SCI3_CTS_PIN_SEL == 1
#define SCI3_CTS_GPIO        digitalIO_PTC1
#define SCI3_CTS_FN          2
#elif SCI3_CTS_PIN_SEL == 2
#define SCI3_CTS_GPIO        digitalIO_PTD5
#define SCI3_CTS_FN          4
#endif

// Pin Mapping for SCI3_RTS signal
//   <o> SCI3_RTS [PTC0, PTD6]<name=SCI3_RTS_PIN_SEL>
//   <i> Shows which pin SCI3_RTS is mapped to
//     <0=> Disabled
//     <1=> PTC0<selection=PTC0_SIG_SEL,SCI3_RTS>
//     <2=> PTD6<selection=PTD6_SIG_SEL,SCI3_RTS>
//     <0=> Default
#define SCI3_RTS_PIN_SEL     0
#if SCI3_RTS_PIN_SEL == 1
#define SCI3_RTS_GPIO        digitalIO_PTC0
#define SCI3_RTS_FN          2
#elif SCI3_RTS_PIN_SEL == 2
#define SCI3_RTS_GPIO        digitalIO_PTD6
#define SCI3_RTS_FN          4
#endif

// Pin Mapping for SCI3_RxD signal
//   <o> SCI3_RxD [PTC3, PTD7]<name=SCI3_RxD_PIN_SEL>
//   <i> Shows which pin SCI3_RxD is mapped to
//     <0=> Disabled
//     <1=> PTC3<selection=PTC3_SIG_SEL,SCI3_RxD>
//     <2=> PTD7<selection=PTD7_SIG_SEL,SCI3_RxD>
//     <0=> Default
#define SCI3_RxD_PIN_SEL     0
#if SCI3_RxD_PIN_SEL == 1
#define SCI3_RxD_GPIO        digitalIO_PTC3
#define SCI3_RxD_FN          2
#elif SCI3_RxD_PIN_SEL == 2
#define SCI3_RxD_GPIO        digitalIO_PTD7
#define SCI3_RxD_FN          4
#endif

// Pin Mapping for SCI3_TxD signal
//   <o> SCI3_TxD [PTC2, PTE0]<name=SCI3_TxD_PIN_SEL>
//   <i> Shows which pin SCI3_TxD is mapped to
//     <0=> Disabled
//     <1=> PTC2<selection=PTC2_SIG_SEL,SCI3_TxD>
//     <2=> PTE0<selection=PTE0_SIG_SEL,SCI3_TxD>
//     <0=> Default
#define SCI3_TxD_PIN_SEL     0
#if SCI3_TxD_PIN_SEL == 1
#define SCI3_TxD_GPIO        digitalIO_PTC2
#define SCI3_TxD_FN          2
#elif SCI3_TxD_PIN_SEL == 2
#define SCI3_TxD_GPIO        digitalIO_PTE0
#define SCI3_TxD_FN          4
#endif

// </h>

// <h> Sigma-delta ADC (SDAD)

// Pin Mapping for SDADM0 signal
//   <o> SDADM0 [SDADM0]<name=SDADM0_PIN_SEL><constant>
//   <i> Shows which pin SDADM0 is mapped to
//     <0=> SDADM0<selection=SDADM0_SIG_SEL,SDADM0>
//     <0=> Default
#define SDADM0_PIN_SEL       0
#define SDADM0_GPIO          0
#define SDADM0_FN            0

