podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5.h
// Pin Mapping for SDADM1 signal
//   <o> SDADM1 [SDADM1]<name=SDADM1_PIN_SEL><constant>
//   <i> Shows which pin SDADM1 is mapped to
//     <0=> SDADM1<selection=SDADM1_SIG_SEL,SDADM1>
//     <0=> Default
#define SDADM1_PIN_SEL       0
#define SDADM1_GPIO          0
#define SDADM1_FN            0

// Pin Mapping for SDADM2 signal
//   <o> SDADM2 [SDADM2]<name=SDADM2_PIN_SEL><constant>
//   <i> Shows which pin SDADM2 is mapped to
//     <0=> SDADM2<selection=SDADM2_SIG_SEL,SDADM2/CMP1P3>
//     <0=> Default
#define SDADM2_PIN_SEL       0
#define SDADM2_GPIO          0
#define SDADM2_FN            0

// Pin Mapping for SDADM3 signal
//   <o> SDADM3 [SDADM3]<name=SDADM3_PIN_SEL><constant>
//   <i> Shows which pin SDADM3 is mapped to
//     <0=> SDADM3<selection=SDADM3_SIG_SEL,SDADM3/CMP1P5>
//     <0=> Default
#define SDADM3_PIN_SEL       0
#define SDADM3_GPIO          0
#define SDADM3_FN            0

// Pin Mapping for SDADP0 signal
//   <o> SDADP0 [SDADP0]<name=SDADP0_PIN_SEL><constant>
//   <i> Shows which pin SDADP0 is mapped to
//     <0=> SDADP0<selection=SDADP0_SIG_SEL,SDADP0>
//     <0=> Default
#define SDADP0_PIN_SEL       0
#define SDADP0_GPIO          0
#define SDADP0_FN            0

// Pin Mapping for SDADP1 signal
//   <o> SDADP1 [SDADP1]<name=SDADP1_PIN_SEL><constant>
//   <i> Shows which pin SDADP1 is mapped to
//     <0=> SDADP1<selection=SDADP1_SIG_SEL,SDADP1>
//     <0=> Default
#define SDADP1_PIN_SEL       0
#define SDADP1_GPIO          0
#define SDADP1_FN            0

// Pin Mapping for SDADP2 signal
//   <o> SDADP2 [SDADP2]<name=SDADP2_PIN_SEL><constant>
//   <i> Shows which pin SDADP2 is mapped to
//     <0=> SDADP2<selection=SDADP2_SIG_SEL,SDADP2/CMP1P2>
//     <0=> Default
#define SDADP2_PIN_SEL       0
#define SDADP2_GPIO          0
#define SDADP2_FN            0

// Pin Mapping for SDADP3 signal
//   <o> SDADP3 [SDADP3]<name=SDADP3_PIN_SEL><constant>
//   <i> Shows which pin SDADP3 is mapped to
//     <0=> SDADP3<selection=SDADP3_SIG_SEL,SDADP3/CMP1P4>
//     <0=> Default
#define SDADP3_PIN_SEL       0
#define SDADP3_GPIO          0
#define SDADP3_FN            0

// </h>

// <h> Serial Peripheral Interface (SPI0)

// Pin Mapping for SPI0_MISO signal
//   <o> SPI0_MISO [PTG5, PTD4]<name=SPI0_MISO_PIN_SEL>
//   <i> Shows which pin SPI0_MISO is mapped to
//     <0=> Disabled
//     <1=> PTG5<selection=PTG5_SIG_SEL,SPI0_MISO>
//     <2=> PTD4<selection=PTD4_SIG_SEL,SPI0_MISO>
//     <0=> Default
#define SPI0_MISO_PIN_SEL    0
#if SPI0_MISO_PIN_SEL == 1
#define SPI0_MISO_GPIO       digitalIO_PTG5
#define SPI0_MISO_FN         2
#elif SPI0_MISO_PIN_SEL == 2
#define SPI0_MISO_GPIO       digitalIO_PTD4
#define SPI0_MISO_FN         3
#endif

// Pin Mapping for SPI0_MOSI signal
//   <o> SPI0_MOSI [PTG4, PTD3]<name=SPI0_MOSI_PIN_SEL>
//   <i> Shows which pin SPI0_MOSI is mapped to
//     <0=> Disabled
//     <1=> PTG4<selection=PTG4_SIG_SEL,SPI0_MOSI>
//     <2=> PTD3<selection=PTD3_SIG_SEL,SPI0_MOSI>
//     <0=> Default
#define SPI0_MOSI_PIN_SEL    0
#if SPI0_MOSI_PIN_SEL == 1
#define SPI0_MOSI_GPIO       digitalIO_PTG4
#define SPI0_MOSI_FN         2
#elif SPI0_MOSI_PIN_SEL == 2
#define SPI0_MOSI_GPIO       digitalIO_PTD3
#define SPI0_MOSI_FN         3
#endif

// Pin Mapping for SPI0_SCK signal
//   <o> SPI0_SCK [PTG3, PTD2]<name=SPI0_SCK_PIN_SEL>
//   <i> Shows which pin SPI0_SCK is mapped to
//     <0=> Disabled
//     <1=> PTG3<selection=PTG3_SIG_SEL,SPI0_SCK>
//     <2=> PTD2<selection=PTD2_SIG_SEL,SPI0_SCK>
//     <0=> Default
#define SPI0_SCK_PIN_SEL     0
#if SPI0_SCK_PIN_SEL == 1
#define SPI0_SCK_GPIO        digitalIO_PTG3
#define SPI0_SCK_FN          2
#elif SPI0_SCK_PIN_SEL == 2
#define SPI0_SCK_GPIO        digitalIO_PTD2
#define SPI0_SCK_FN          3
#endif

// Pin Mapping for SPI0_SS_B signal
//   <o> SPI0_SS_B [PTG2, PTD1]<name=SPI0_SS_B_PIN_SEL>
//   <i> Shows which pin SPI0_SS_B is mapped to
//     <0=> Disabled
//     <1=> PTG2<selection=PTG2_SIG_SEL,SPI0_SS_B>
//     <2=> PTD1 (Alias:LED_BLUE)<selection=PTD1_SIG_SEL,SPI0_SS_B>
//     <0=> Default
#define SPI0_SS_B_PIN_SEL    0
#if SPI0_SS_B_PIN_SEL == 1
#define SPI0_SS_B_GPIO       digitalIO_PTG2
#define SPI0_SS_B_FN         2
#elif SPI0_SS_B_PIN_SEL == 2
#define SPI0_SS_B_GPIO       digitalIO_PTD1
#define SPI0_SS_B_FN         3
#endif

// </h>

// <h> Serial Peripheral Interface (SPI1)

// Pin Mapping for SPI1_MISO signal
//   <o> SPI1_MISO [PTF5, PTI0, PTI1]<name=SPI1_MISO_PIN_SEL>
//   <i> Shows which pin SPI1_MISO is mapped to
//     <0=> Disabled
//     <1=> PTF5<selection=PTF5_SIG_SEL,SPI1_MISO>
//     <2=> PTI0<selection=PTI0_SIG_SEL,SPI1_MISO>
//     <3=> PTI1<selection=PTI1_SIG_SEL,SPI1_MISO>
//     <0=> Default
#define SPI1_MISO_PIN_SEL    0
#if SPI1_MISO_PIN_SEL == 1
#define SPI1_MISO_GPIO       digitalIO_PTF5
#define SPI1_MISO_FN         2
#elif SPI1_MISO_PIN_SEL == 2
#define SPI1_MISO_GPIO       digitalIO_PTI0
#define SPI1_MISO_FN         4
#elif SPI1_MISO_PIN_SEL == 3
#define SPI1_MISO_GPIO       digitalIO_PTI1
#define SPI1_MISO_FN         5
#endif

// Pin Mapping for SPI1_MOSI signal
//   <o> SPI1_MOSI [PTF6, PTI1, PTI0]<name=SPI1_MOSI_PIN_SEL>
//   <i> Shows which pin SPI1_MOSI is mapped to
//     <0=> Disabled
//     <1=> PTF6<selection=PTF6_SIG_SEL,SPI1_MOSI>
//     <2=> PTI1<selection=PTI1_SIG_SEL,SPI1_MOSI>
//     <3=> PTI0<selection=PTI0_SIG_SEL,SPI1_MOSI>
//     <0=> Default
#define SPI1_MOSI_PIN_SEL    0
#if SPI1_MOSI_PIN_SEL == 1
#define SPI1_MOSI_GPIO       digitalIO_PTF6
#define SPI1_MOSI_FN         2
#elif SPI1_MOSI_PIN_SEL == 2
#define SPI1_MOSI_GPIO       digitalIO_PTI1
#define SPI1_MOSI_FN         4
#elif SPI1_MOSI_PIN_SEL == 3
#define SPI1_MOSI_GPIO       digitalIO_PTI0
#define SPI1_MOSI_FN         5
#endif

// Pin Mapping for SPI1_SCK signal
//   <o> SPI1_SCK [PTF4, PTH7]<name=SPI1_SCK_PIN_SEL>
//   <i> Shows which pin SPI1_SCK is mapped to
//     <0=> Disabled
//     <1=> PTF4<selection=PTF4_SIG_SEL,SPI1_SCK>
//     <2=> PTH7<selection=PTH7_SIG_SEL,SPI1_SCK>
//     <0=> Default
#define SPI1_SCK_PIN_SEL     0
#if SPI1_SCK_PIN_SEL == 1
#define SPI1_SCK_GPIO        digitalIO_PTF4
#define SPI1_SCK_FN          2
#elif SPI1_SCK_PIN_SEL == 2
#define SPI1_SCK_GPIO        digitalIO_PTH7
#define SPI1_SCK_FN          3
#endif

// Pin Mapping for SPI1_SS_B signal
//   <o> SPI1_SS_B [PTF3, PTH6]<name=SPI1_SS_B_PIN_SEL>
//   <i> Shows which pin SPI1_SS_B is mapped to
//     <0=> Disabled
//     <1=> PTF3<selection=PTF3_SIG_SEL,SPI1_SS_B>
//     <2=> PTH6<selection=PTH6_SIG_SEL,SPI1_SS_B>
//     <0=> Default
#define SPI1_SS_B_PIN_SEL    0
#if SPI1_SS_B_PIN_SEL == 1
#define SPI1_SS_B_GPIO       digitalIO_PTF3
#define SPI1_SS_B_FN         2
#elif SPI1_SS_B_PIN_SEL == 2
#define SPI1_SS_B_GPIO       digitalIO_PTH6
#define SPI1_SS_B_FN         3
#endif

